{
  "Sun": {
    "1": "### Sun in 1st House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Strong self-expression, leadership, and vitality; prominent personality and generally good health.\n- Lagna (1st house) with Sun gives natural authority and confidence; mixed results possible if Sun is afflicted.\n\n*** Opportunities:\n- Leadership abilities and respect in society; potential for power and eminence.\n- Good health and vitality; success through self-initiative and courage.\n- Strong identity and ability to influence others.\n\n*** Challenges:\n- Ego or arrogance if Sun is poorly placed; possible tension with father or authority figures.\n- Health issues related to heart, bones, or eyes if afflicted by malefics.\n\n*** Recommendations:\n- Wear Ruby or Red Coral to strengthen Sun; chant Surya Mantra for spiritual support.\n- Practice humility and respect for elders to balance strong self-expression.",
    "2": "### Sun in 2nd House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Wealth, family reputation, and speech are influenced by Sun; financial gains and respect from family indicated.\n- Mixed influences on accumulated wealth; family honour and speech may be strong.\n\n*** Opportunities:\n- Gains through family legacy, land, or government-related sources.\n- Strong speech and ability to persuade; respect from family and community.\n- Potential for wealth accumulation with discipline.\n\n*** Challenges:\n- Financial stability may be compromised if Sun is afflicted; strained relations with father or elders.\n- Speech may be harsh or authoritative, affecting relationships.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Surya or Gayatri Mantra for overall strength.\n- Practice moderation in speech and maintain good character for long-term financial stability.",
    "3": "### Sun in 3rd House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Courage, siblings, and short travels strengthened; native may be bold and achieve through own effort.\n- Good for valour, writing, and communication when well placed.\n\n*** Opportunities:\n- Victory over competitors; success in sports, media, or short travels.\n- Strong sibling support or leadership among siblings; gains through courage and initiative.\n- Success in fields requiring boldness and communication.\n\n*** Challenges:\n- Ego clashes with siblings or in local matters; possible health issues related to arms or nervous system.\n- Overconfidence may lead to setbacks in short-term ventures.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Hanuman Chalisa or Surya Mantra.\n- Balance courage with patience; maintain good relations with siblings.",
    "4": "### Sun in 4th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Mother, property, and inner peace influenced; mixed results regarding property and domestic happiness.\n- Sun in 4th can create tension between authority and comfort at home.\n\n*** Opportunities:\n- Property gains through government or authority; possible inheritance or land.\n- Success in real estate or fixed assets with careful planning.\n- Respect from mother or maternal side with good placement.\n\n*** Challenges:\n- Strained relationship with mother or domestic peace; property disputes or delays.\n- Heart or emotional stress; instability in residence or vehicles.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Surya Mantra and honour mother.\n- Avoid property disputes; seek legal clarity in land matters.",
    "5": "### Sun in 5th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Intelligence, children, and creativity supported; good for education and speculative gains when well placed.\n- Mixed results for progeny and speculation; authority in creative or educational fields possible.\n\n*** Opportunities:\n- Leadership in education, politics, or creative fields; gains through speculation with caution.\n- Intelligent and dignified children; respect through knowledge and dharma.\n- Potential for fame through creative or intellectual work.\n\n*** Challenges:\n- Ego issues with children or in speculative matters; possible delays in progeny.\n- Speculation may lead to losses if Sun is afflicted; stress related to heart or stomach.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Gayatri Mantra for intellect and progeny.\n- Avoid reckless speculation; nurture children with patience and humility.",
    "6": "### Sun in 6th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Victory over enemies and support in health matters; service and routine work may be prominent.\n- Generally favourable for 6th house matters when Sun is strong.\n\n*** Opportunities:\n- Success in legal matters, competition, and overcoming enemies.\n- Health can be managed well with discipline; service in government or authority roles.\n- Gains through service, health sector, or dealing with opponents.\n\n*** Challenges:\n- Health issues related to digestion, skin, or heart if afflicted.\n- Ego clashes in service or with subordinates; possible litigation.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; maintain regular health check-ups and discipline.\n- Chant Surya Mantra; avoid unnecessary conflicts and legal disputes.",
    "7": "### Sun in 7th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Marriage and partnerships influenced; spouse may be dignified; business partnerships need careful handling.\n- Mixed results in marriage; authority and balance in partnership required.\n\n*** Opportunities:\n- Dignified and responsible spouse; success in business partnerships with shared authority.\n- Respect in public life and through spouse; gains through marriage or legal partnerships.\n- Potential for fame and travel with spouse.\n\n*** Challenges:\n- Ego clashes in marriage or partnership; dominance may strain relationship.\n- Delays or difficulties in marriage if Sun is afflicted; spouse may have health or authority issues.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Surya Mantra; practice equality and respect in partnership.\n- Avoid dominating spouse; seek balance between self and partner.",
    "8": "### Sun in 8th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Focus on longevity, transformation, and occult interests; inheritance or sudden events indicated.\n- Sun in 8th is generally challenging but can give research ability and interest in occult.\n\n*** Opportunities:\n- Inheritance, research, or gains through transformation; interest in astrology or healing.\n- Long life with discipline; possible gains through spouse or partner's wealth.\n- Success in occult or investigative fields.\n\n*** Challenges:\n- Health issues or stress related to longevity; possible setbacks with father or authority.\n- Sudden losses or gains; transformation may be difficult; secrecy or disputes in inheritance.\n\n*** Recommendations:\n- Wear Ruby or Red Coral with caution; chant Surya and Maha Mrityunjaya Mantra.\n- Avoid risky investments; maintain health discipline and legal clarity in inheritance.",
    "9": "### Sun in 9th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Father, higher education, and dharma supported; fortune through wisdom and long travels possible.\n- Strong placement for luck, guru, and spiritual or philosophical growth.\n\n*** Opportunities:\n- Respect from father and elders; success in higher education, law, or religion.\n- Long travels and foreign connections; fortune through dharma and good deeds.\n- Raja Yoga potential; fame and authority through wisdom and righteousness.\n\n*** Challenges:\n- Ego in matters of faith or with father; possible distance from father or guru.\n- Overconfidence in luck or philosophy may lead to setbacks.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Gayatri Mantra and honour father and guru.\n- Practice humility in spiritual and philosophical pursuits.",
    "10": "### Sun in 10th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Strong for career, authority, and reputation; native may hold position and respect in society.\n- Natural leadership in profession; fame and authority when well placed.\n\n*** Opportunities:\n- High position in government, administration, or leadership roles; Raja Yoga potential.\n- Strong reputation and respect; success through discipline and authority.\n- Gains through career and public life; support from superiors.\n\n*** Challenges:\n- Ego or conflict with authority; stress from responsibility and public scrutiny.\n- Relationship with mother may need attention; possible delays in early career.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Surya Mantra for career strength.\n- Balance authority with humility; maintain good relations with mother and superiors.",
    "11": "### Sun in 11th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains, friends, and fulfillment of desires supported; income and network may grow over time.\n- Good for gains and social circle when Sun is well placed.\n\n*** Opportunities:\n- Gains through authority, government, or senior contacts; fulfillment of ambitions.\n- Strong network and friends in high places; income growth with effort.\n- Success in group activities and organizations.\n\n*** Challenges:\n- Ego may affect friendships; gains may come with delay or effort.\n- Health or expenses may impact savings; possible disputes in groups.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; chant Surya Mantra; use gains wisely.\n- Maintain humility with friends and avoid overspending.",
    "12": "### Sun in 12th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses, foreign lands, and spirituality influenced; solitude or behind-the-scenes work significant.\n- Sun in 12th can indicate foreign stay, spirituality, or expenditure.\n\n*** Opportunities:\n- Success in foreign lands, spirituality, or charitable work; inner growth.\n- Gains through hospitals, ashrams, or secluded work; possible inheritance.\n- Liberation through discipline and reduced ego.\n\n*** Challenges:\n- Expenses and losses; possible confinement, litigation, or separation from father.\n- Health issues or stress; need for rest and spiritual practice.\n\n*** Recommendations:\n- Wear Ruby or Red Coral with guidance; chant Surya Mantra and practice charity.\n- Avoid unnecessary expenses; focus on spirituality and rest."
  },
  "Moon": {
    "1": "### Moon in 1st House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Sensitive, changing personality and strong emotional nature; imaginative and receptive.\n- Good for public appeal and mental strength when well placed.\n\n*** Opportunities:\n- Charm and popularity; success in creative or public-facing roles.\n- Strong intuition and imagination; comfort from mother and family.\n- Ability to connect with masses and adapt to situations.\n\n*** Challenges:\n- Mood swings and emotional sensitivity; possible digestive or mental stress.\n- Need for emotional security; over-sensitivity may affect decisions.\n\n*** Recommendations:\n- Wear Moonstone or Pearl to enhance Moon; chant Chandra Mantra or Gayatri Mantra.\n- Practice emotional balance and avoid impulsive decisions.",
    "2": "### Moon in 2nd House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Wealth through liquids, trade, or mother; family and savings may fluctuate but can grow.\n- Speech and family reputation influenced by emotions and mother.\n\n*** Opportunities:\n- Gains through trade, liquids, or maternal support; fluctuating but positive income.\n- Good speech and ability to persuade; family support in wealth.\n- Success in food, dairy, or hospitality-related ventures.\n\n*** Challenges:\n- Financial instability due to mood or changing plans; possible speech or eye issues.\n- Savings may fluctuate; need for discipline in spending.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; maintain emotional stability for wealth.\n- Avoid emotional spending; seek mother's blessings.",
    "3": "### Moon in 3rd House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Communication, siblings, and short journeys strengthened; mind may be restless but creative.\n- Good for writing, media, and local travel when well placed.\n\n*** Opportunities:\n- Success in communication, arts, or short travels; support from siblings.\n- Creative and versatile mind; gains through writing or trade.\n- Good relations with neighbours and younger siblings.\n\n*** Challenges:\n- Mental restlessness or anxiety; possible respiratory or nervous system issues.\n- Changing plans in short travels; sibling relations may need care.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; practice meditation for calm.\n- Maintain good relations with siblings and avoid overthinking.",
    "4": "### Moon in 4th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Emotional attachment to home and mother; comfort from property and family indicated.\n- Strong placement for domestic happiness and emotional security.\n\n*** Opportunities:\n- Happiness from mother, property, and vehicles; comfortable home and family.\n- Success in real estate, agriculture, or domestic ventures.\n- Strong emotional base and public support.\n\n*** Challenges:\n- Over-attachment to mother or home; possible mood-related stress.\n- Property or vehicle matters may have delays; digestive sensitivity.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; honour mother and home.\n- Balance emotion with practicality in property matters.",
    "5": "### Moon in 5th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Intelligence, children, and creative expression supported; emotional bond with children strong.\n- Good for speculation and creative arts when Moon is strong.\n\n*** Opportunities:\n- Intelligent and emotional children; success in creative or speculative fields.\n- Good memory and imagination; gains through arts or education.\n- Romance and pleasure from creative pursuits.\n\n*** Challenges:\n- Emotional stress related to children or speculation; mood affects decisions.\n- Speculation may be risky; possible stomach or heart sensitivity.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; avoid reckless speculation.\n- Nurture children with love and stability.",
    "6": "### Moon in 6th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Anxiety regarding health or service possible; enemies may be overcome with patience.\n- Mixed results; need for emotional balance in service and health.\n\n*** Opportunities:\n- Victory over enemies through patience and strategy; service in healing or care.\n- Gains through nursing, food, or service sector; ability to manage routine.\n- Recovery from health issues with proper care.\n\n*** Challenges:\n- Health issues related to digestion, fluids, or mind; anxiety and stress.\n- Enemies may use emotional weakness; service may be draining.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; maintain health discipline.\n- Avoid emotional involvement with opponents; practice detachment in service.",
    "7": "### Moon in 7th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Marriage and public life influenced; spouse may be emotional and caring; partnerships need balance.\n- Good for marriage and public appeal when well placed.\n\n*** Opportunities:\n- Caring and emotional spouse; success in partnership and public life.\n- Gains through spouse or business partnership; popularity and travel.\n- Balanced and harmonious relationship with right effort.\n\n*** Challenges:\n- Mood swings may affect partnership; possible delays in marriage.\n- Spouse may have health or emotional sensitivity; need for mutual understanding.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; practice emotional balance in marriage.\n- Support spouse's emotional needs; avoid public conflict.",
    "8": "### Moon in 8th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Interest in occult, longevity, and transformation; emotional ups and downs in life possible.\n- Research and inheritance matters influenced by emotions.\n\n*** Opportunities:\n- Interest in occult, research, or healing; gains through inheritance or spouse.\n- Transformation through emotional maturity; possible long life with care.\n- Success in research or behind-the-scenes work.\n\n*** Challenges:\n- Emotional stress and anxiety; possible health or longevity concerns.\n- Inheritance disputes or delays; fear or secrecy in life.\n\n*** Recommendations:\n- Wear Moonstone or Pearl with care; chant Chandra and Maha Mrityunjaya Mantra.\n- Avoid obsession with occult; maintain mental and physical health.",
    "9": "### Moon in 9th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Faith, higher learning, and travel supported; mother or guru may play important role.\n- Good for fortune and philosophy when Moon is strong.\n\n*** Opportunities:\n- Fortune through mother, guru, or higher education; long travels and wisdom.\n- Strong faith and philosophical bent; gains through spirituality or teaching.\n- Respect from elders and foreign connections.\n\n*** Challenges:\n- Emotional approach to religion or philosophy; possible distance from father.\n- Changing beliefs or restlessness in higher learning.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; honour mother and guru.\n- Practice consistent faith and avoid emotional extremes in philosophy.",
    "10": "### Moon in 10th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Fluctuating career but public recognition; profession may involve public dealing or emotions.\n- Success in creative or people-oriented careers.\n\n*** Opportunities:\n- Career in public life, arts, or hospitality; fame and recognition.\n- Support from mother and superiors; success through adaptability.\n- Gains through government or public sector when well placed.\n\n*** Challenges:\n- Career fluctuations due to mood or external factors; stress from public scrutiny.\n- Relationship with mother may affect career; need for emotional stability.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; maintain professional composure.\n- Balance public image with private emotional needs.",
    "11": "### Moon in 11th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains, friends, and wishes supported; income may come from varied or creative sources.\n- Good for fulfillment of desires and social circle.\n\n*** Opportunities:\n- Gains through friends, mother, or creative ventures; income from multiple sources.\n- Strong network and social success; wishes fulfilled with patience.\n- Success in groups and organizations.\n\n*** Challenges:\n- Fluctuating gains; emotional spending or dependency on others.\n- Friends may be changeable; need for stable income planning.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; use gains wisely.\n- Build stable friendships and avoid emotional financial decisions.",
    "12": "### Moon in 12th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Solitude, spirituality, and expenses influenced; inner peace through meditation or retreat possible.\n- Interest in spirituality and behind-the-scenes work.\n\n*** Opportunities:\n- Spiritual growth and interest in meditation or retreats.\n- Gains through foreign lands, hospitals, or charitable work.\n- Liberation through reduced attachment and inner peace.\n\n*** Challenges:\n- Expenses and losses; possible confinement or separation from mother.\n- Emotional loneliness or health issues; need for rest and recovery.\n\n*** Recommendations:\n- Wear Moonstone or Pearl; chant Chandra Mantra; practice meditation and charity.\n- Avoid unnecessary expenses; focus on spiritual and mental rest."
  },
  "Mars": {
    "1": "### Mars in 1st House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Courage, energy, and competitive nature; native may be athletic or prone to anger if afflicted.\n- Strong physical energy and drive when well placed.\n\n*** Opportunities:\n- Leadership through courage; success in sports, defence, or technical fields.\n- Strong will and ability to overcome obstacles; respect through valour.\n- Success in real estate, metals, or engineering.\n\n*** Challenges:\n- Anger, impulsiveness, or accidents if Mars is afflicted.\n- Possible skin, blood, or injury-related issues; conflict with others.\n\n*** Recommendations:\n- Wear Red Coral or Ruby; chant Hanuman Chalisa or Mangal Mantra.\n- Channel energy into sports or discipline; avoid aggression and haste.",
    "2": "### Mars in 2nd House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Family wealth and speech influenced; gains through land, metals, or technical work possible.\n- Mixed results; speech may be sharp or assertive.\n\n*** Opportunities:\n- Wealth through property, engineering, or technical skills.\n- Strong speech and ability to defend; gains with courage and effort.\n- Family support in financial matters with discipline.\n\n*** Challenges:\n- Financial disputes or impulsive spending; harsh speech affecting relations.\n- Possible eye or face-related issues; strained family relations.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; control speech and temper.\n- Avoid financial risks and maintain family harmony.",
    "3": "### Mars in 3rd House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Courage, siblings, and short travels strengthened; bold and achieving through initiative.\n- Strong placement for valour, writing, and communication.\n\n*** Opportunities:\n- Success in sports, media, army, or short travels; strong sibling support.\n- Victory over competitors; gains through courage and communication.\n- Leadership in local matters and technical fields.\n\n*** Challenges:\n- Ego clashes with siblings or in communication; possible injury or surgery.\n- Over-aggression in short travels or competition.\n\n*** Recommendations:\n- Wear Red Coral; chant Hanuman Chalisa or Mangal Mantra.\n- Balance courage with patience; maintain sibling harmony.",
    "4": "### Mars in 4th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Tension regarding mother or property possible; moving or changes at home indicated.\n- Mixed results for domestic peace and property.\n\n*** Opportunities:\n- Property through own effort or technical work; gains in real estate.\n- Courage to change residence or improve home; success with discipline.\n- Mother may be strong or independent.\n\n*** Challenges:\n- Strained relation with mother; property disputes or fires.\n- Restlessness at home; possible heart or chest-related issues.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; honour mother and avoid property disputes.\n- Ensure safety at home; avoid impulsive property decisions.",
    "5": "### Mars in 5th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Speculative gains and children supported; creativity and sports may be important.\n- Mixed results for progeny and speculation; need for caution.\n\n*** Opportunities:\n- Success in sports, speculation, or technical creativity.\n- Energetic and bold children; gains through initiative in speculation.\n- Interest in science, engineering, or competitive fields.\n\n*** Challenges:\n- Risk of losses in speculation; possible delays or stress with children.\n- Anger or impulsiveness in creative or romantic matters.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; avoid reckless speculation.\n- Channel energy into sports or studies; nurture children with patience.",
    "6": "### Mars in 6th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Generally good for victory over enemies and health; service in technical or armed fields indicated.\n- Strong placement for 6th house matters.\n\n*** Opportunities:\n- Victory over enemies and competitors; success in litigation.\n- Good health and recovery; service in army, police, or engineering.\n- Gains through service, health sector, or dealing with opponents.\n\n*** Challenges:\n- Health issues related to blood, skin, or injuries if afflicted.\n- Possible conflict with subordinates or in service.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; maintain health discipline.\n- Avoid unnecessary conflicts; use courage for constructive service.",
    "7": "### Mars in 7th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Marriage and partnerships influenced; spouse may be energetic; disputes need to be managed.\n- Mixed results; need for patience and balance in partnership.\n\n*** Opportunities:\n- Spouse may be courageous or from technical/armed background.\n- Success in business partnership with shared drive; gains through spouse.\n- Victory in legal or partnership matters with effort.\n\n*** Challenges:\n- Disputes and aggression in marriage or partnership.\n- Delays in marriage or spouse may have health issues; possible separation.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; practice patience and respect in partnership.\n- Avoid arguments; seek counselling if needed.",
    "8": "### Mars in 8th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Interest in occult, longevity, and sudden events; inheritance or surgery may be indicated.\n- Transformation and research ability; mixed results for longevity.\n\n*** Opportunities:\n- Success in research, surgery, or occult; inheritance or sudden gains.\n- Courage in facing transformation; interest in astrology or healing.\n- Gains through spouse's wealth or inheritance.\n\n*** Challenges:\n- Accidents, surgery, or sudden events; possible conflict over inheritance.\n- Health or longevity concerns; stress and transformation.\n\n*** Recommendations:\n- Wear Red Coral with care; chant Mangal and Maha Mrityunjaya Mantra.\n- Avoid risks and violence; maintain health and legal clarity.",
    "9": "### Mars in 9th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Luck, father, and higher education supported; long travels and legal matters may play a role.\n- Mixed results; courage in matters of dharma and philosophy.\n\n*** Opportunities:\n- Success in law, religion, or long travels; support from father.\n- Gains through higher education or foreign connections.\n- Courage in faith and philosophical pursuits.\n\n*** Challenges:\n- Ego or conflict with father; possible legal or religious disputes.\n- Long travels may involve risk or delay; philosophical rigidity.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; honour father and dharma.\n- Balance courage with wisdom in legal and religious matters.",
    "10": "### Mars in 10th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Strong career in technical, engineering, or leadership roles; reputation through hard work.\n- Good for authority and profession when well placed.\n\n*** Opportunities:\n- Success in engineering, army, police, or administration.\n- Strong reputation and authority; gains through career and discipline.\n- Leadership in technical or defence-related fields.\n\n*** Challenges:\n- Conflict with mother or authority; stress from responsibility.\n- Career may involve risk or injury; need for patience with superiors.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; balance ambition with respect.\n- Maintain good relations with mother and avoid impulsive career moves.",
    "11": "### Mars in 11th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains, friends, and desires supported; income through real estate or technical work possible.\n- Good for gains and fulfillment of ambitions.\n\n*** Opportunities:\n- Gains through property, technical work, or senior friends.\n- Strong network in technical or defence circles; income growth with effort.\n- Success in organizations and group leadership.\n\n*** Challenges:\n- Gains may come with effort or delay; possible disputes in groups.\n- Expenditure on property or technical matters; need for patience.\n\n*** Recommendations:\n- Wear Red Coral; chant Mangal Mantra; use gains for stable assets.\n- Avoid aggressive pursuit of gains; maintain friendship.",
    "12": "### Mars in 12th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses, foreign lands, and confinement influenced; spiritual or charitable work may appeal.\n- Mixed results; possible stay in foreign land or institutions.\n\n*** Opportunities:\n- Success in foreign lands, hospitals, or spiritual institutions.\n- Gains through export, defence abroad, or charitable work.\n- Liberation through discipline and reduced aggression.\n\n*** Challenges:\n- Expenses, losses, or confinement; possible litigation or separation.\n- Health issues or stay in hospital; stress and isolation.\n\n*** Recommendations:\n- Wear Red Coral with guidance; chant Mangal Mantra; practice charity.\n- Avoid litigation and violence; focus on spirituality and rest."
  },
  "Mercury": {
    "1": "### Mercury in 1st House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Sharp intellect, good communication, and youthful appearance; witty and curious.\n- Strong for learning and expression when well placed.\n\n*** Opportunities:\n- Success in education, writing, and business; quick learning and adaptability.\n- Good communication and negotiation skills; respect through intellect.\n- Success in media, trade, or accounts.\n\n*** Challenges:\n- Nervousness or restlessness; possible skin or respiratory issues.\n- Over-analysis or indecision; need for focus and consistency.\n\n*** Recommendations:\n- Wear Emerald or Green Tourmaline; chant Budh Mantra or Vishnu Mantra.\n- Practice focus and avoid gossip; strengthen respiratory health.",
    "2": "### Mercury in 2nd House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Wealth through business, writing, or speech; family and savings may grow through intellect.\n- Strong placement for wealth and family.\n\n*** Opportunities:\n- Gains through trade, writing, or accounts; strong family support.\n- Excellent speech and business acumen; accumulation of wealth.\n- Success in family business or communication-based ventures.\n\n*** Challenges:\n- Speech may be too sharp or critical; possible dental or speech issues.\n- Wealth may fluctuate with Mercury's changing nature.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; use speech positively.\n- Maintain accounts and avoid speculative speech.",
    "3": "### Mercury in 3rd House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Communication, siblings, and short travels strengthened; writing or trade may be prominent.\n- Excellent placement for 3rd house matters.\n\n*** Opportunities:\n- Success in writing, media, trade, and short travels; strong sibling relations.\n- Multiple skills and versatility; gains through communication and travel.\n- Good relations with neighbours and younger siblings.\n\n*** Challenges:\n- Restlessness or too many interests; possible nervous system issues.\n- Sibling rivalry or communication gaps; need for focus.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; prioritise and complete tasks.\n- Maintain good relations with siblings; avoid spreading too thin.",
    "4": "### Mercury in 4th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Comfort from education and property; mother may be intellectual; home environment peaceful.\n- Good for domestic happiness and learning.\n\n*** Opportunities:\n- Happiness from mother and education; comfortable home and vehicles.\n- Success in property or education-related ventures; good memory.\n- Intellectual environment at home.\n\n*** Challenges:\n- Mental restlessness at home; possible property or vehicle delays.\n- Mother may have health or travel-related issues.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; honour mother and maintain home.\n- Create a study or peaceful corner at home.",
    "5": "### Mercury in 5th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Intelligence, children, and creativity supported; education and speculative gains favored.\n- Strong for 5th house matters when well placed.\n\n*** Opportunities:\n- Intelligent and witty children; success in education and speculation.\n- Creative writing or business; gains through intellect and creativity.\n- Good memory and reasoning; success in competitive exams.\n\n*** Challenges:\n- Over-analysis in speculation; possible nervous stress.\n- Children may be restless or need extra attention in studies.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; avoid over-speculation.\n- Support children's education and creativity.",
    "6": "### Mercury in 6th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Help in overcoming enemies and health issues; service in communication or accounts indicated.\n- Good for 6th house when Mercury is strong.\n\n*** Opportunities:\n- Victory in litigation and over enemies through strategy.\n- Success in health sector, accounts, or service; good recovery.\n- Gains through writing, trade, or routine work.\n\n*** Challenges:\n- Nervous or digestive issues; possible speech-related disputes.\n- Service may be stressful; need for mental balance.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; maintain health and avoid disputes.\n- Use communication skills constructively in service.",
    "7": "### Mercury in 7th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Marriage and business partnerships influenced; spouse may be intelligent and communicative.\n- Good for partnership and business.\n\n*** Opportunities:\n- Intelligent and communicative spouse; success in business partnership.\n- Gains through spouse or trade; good relations and negotiation.\n- Success in legal or contractual matters.\n\n*** Challenges:\n- Restlessness in partnership; possible delay in marriage.\n- Spouse may have nervous or health issues; need for patience.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; practice clear communication in marriage.\n- Avoid criticism of spouse; support mutual growth.",
    "8": "### Mercury in 8th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Interest in research, occult, and transformation; inheritance or sudden gains possible.\n- Mixed results; research and analysis ability.\n\n*** Opportunities:\n- Success in research, occult, or investigative work.\n- Gains through inheritance, writing, or sudden opportunities.\n- Interest in astrology, healing, or transformation.\n\n*** Challenges:\n- Nervous stress or anxiety; possible speech or respiratory issues.\n- Inheritance disputes or delays; sudden gains and losses.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; avoid obsession with occult.\n- Legal clarity in inheritance; maintain mental health.",
    "9": "### Mercury in 9th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Higher education, father, and long travels supported; wisdom and dharma important.\n- Good for learning and fortune.\n\n*** Opportunities:\n- Success in higher education and long travels; support from father.\n- Gains through teaching, writing, or philosophy; good fortune.\n- Intellectual and philosophical growth.\n\n*** Challenges:\n- Restlessness in belief or with father; possible delay in higher education.\n- Over-analysis of philosophy; need for faith.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; honour father and guru.\n- Balance intellect with faith in spiritual matters.",
    "10": "### Mercury in 10th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Career in business, writing, or communication; reputation through intellect and skill.\n- Strong for career and reputation.\n\n*** Opportunities:\n- Success in business, media, or accounts; strong reputation.\n- Gains through career and communication; support from superiors.\n- Multiple skills and adaptability in profession.\n\n*** Challenges:\n- Stress from multiple responsibilities; possible nervous issues.\n- Relationship with mother may need attention; need for focus.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; prioritise career tasks.\n- Maintain balance between career and family.",
    "11": "### Mercury in 11th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Gains, friends, and fulfillment of desires supported; income through trade or consultancy.\n- Excellent for gains and network.\n\n*** Opportunities:\n- Gains through friends, trade, or writing; strong network.\n- Fulfillment of desires and income growth; success in groups.\n- Multiple sources of income and intellectual friends.\n\n*** Challenges:\n- Gains may fluctuate; possible nervous or respiratory issues.\n- Friends may be changeable; need for stable planning.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; use gains for education or assets.\n- Choose friends wisely; avoid gossip.",
    "12": "### Mercury in 12th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses, foreign lands, and solitude influenced; spiritual or secretive pursuits may appeal.\n- Mixed results; interest in behind-the-scenes work.\n\n*** Opportunities:\n- Success in foreign lands, research, or spiritual writing.\n- Gains through export or secretive work; interest in meditation.\n- Liberation through reduced mental restlessness.\n\n*** Challenges:\n- Expenses and losses; possible confinement or litigation.\n- Nervous stress or sleep issues; separation from family.\n\n*** Recommendations:\n- Wear Emerald; chant Budh Mantra; practice meditation and charity.\n- Avoid unnecessary expenses and legal issues."
  },
  "Jupiter": {
    "1": "### Jupiter in 1st House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Wisdom, optimism, and generous nature; native may be respected and have good health.\n- Strong for personality and fortune when well placed.\n\n*** Opportunities:\n- Respect and good fortune; success in education, law, or religion.\n- Generous and righteous nature; support from elders and guru.\n- Good health and longevity; Raja Yoga potential.\n\n*** Challenges:\n- Over-optimism or over-expansion; possible weight or liver issues.\n- Ego in matters of wisdom; need for humility.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pukhraj; chant Guru Mantra or Vishnu Mantra.\n- Practice humility and avoid over-indulgence.",
    "2": "### Jupiter in 2nd House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Wealth, family, and speech supported; accumulation of assets and family prosperity indicated.\n- Strong for wealth and family.\n\n*** Opportunities:\n- Steady accumulation of wealth; strong family and speech.\n- Gains through education, law, or family business; respect from family.\n- Good fortune in financial matters.\n\n*** Challenges:\n- Over-spending or over-optimism in wealth; possible dental or throat issues.\n- Speech may be preachy; need for moderation.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; use wealth wisely.\n- Avoid excessive spending and maintain family harmony.",
    "3": "### Jupiter in 3rd House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Siblings, courage, and short travels strengthened; good relations with siblings and gains through them.\n- Good for communication and local success.\n\n*** Opportunities:\n- Strong sibling support and success in short travels.\n- Gains through writing, teaching, or communication; courage with wisdom.\n- Good relations with neighbours and younger siblings.\n\n*** Challenges:\n- Possible over-optimism in short-term matters; minor health issues.\n- Sibling relations may need patience; avoid preaching.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; support siblings.\n- Balance optimism with practicality in short travels.",
    "4": "### Jupiter in 4th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Happiness from mother, property, and education; comfortable home and vehicles possible.\n- Strong for domestic happiness and property.\n\n*** Opportunities:\n- Comfortable home and vehicles; happiness from mother and education.\n- Success in property and real estate; good fortune at home.\n- Respect and support from mother and family.\n\n*** Challenges:\n- Over-attachment to home or comfort; possible weight issues.\n- Property matters may have delays; need for patience.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; honour mother and home.\n- Avoid over-indulgence in comfort.",
    "5": "### Jupiter in 5th House ###\n*** Ranking: 9/10\n\n*** Prediction:\n- Children, intelligence, and spiritual learning supported; good for education and progeny.\n- One of the best placements for 5th house.\n\n*** Opportunities:\n- Intelligent and fortunate children; success in education and speculation.\n- Spiritual learning and good fortune; Raja Yoga potential.\n- Creativity with wisdom; gains through children and intellect.\n\n*** Challenges:\n- Over-optimism in speculation; possible indulgence with children.\n- Need for balance in spending on education or children.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; nurture children with wisdom.\n- Avoid over-speculation; practice moderation.",
    "6": "### Jupiter in 6th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Help in overcoming enemies and health issues; service and charity may be important.\n- Mixed results; generally supportive for 6th house.\n\n*** Opportunities:\n- Victory over enemies through wisdom and patience.\n- Success in health sector, service, or charity; good recovery.\n- Gains through service and helping others.\n\n*** Challenges:\n- Possible health issues related to liver, digestion, or weight.\n- Enemies may be influential; need for patience and strategy.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; maintain health discipline.\n- Practice charity and avoid arrogance in service.",
    "7": "### Jupiter in 7th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Marriage and partnerships influenced positively; spouse may be wise and supportive.\n- Strong for marriage and partnership.\n\n*** Opportunities:\n- Wise and supportive spouse; success in marriage and business partnership.\n- Gains through spouse and foreign connections; good fortune in partnership.\n- Respect and harmony in relationship.\n\n*** Challenges:\n- Over-optimism in partnership; possible weight or indulgence.\n- Spouse may have health issues; need for mutual respect.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; respect and support spouse.\n- Avoid over-indulgence; maintain balance in partnership.",
    "8": "### Jupiter in 8th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Interest in occult, longevity, and inheritance; spiritual transformation possible.\n- Mixed results; wisdom in transformation matters.\n\n*** Opportunities:\n- Success in occult, research, or spiritual transformation.\n- Inheritance or gains through spouse; long life with wisdom.\n- Interest in astrology, philosophy, or healing.\n\n*** Challenges:\n- Possible delays in inheritance; health issues related to liver or digestion.\n- Over-optimism in risky matters; need for caution.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru and Maha Mrityunjaya Mantra.\n- Avoid risky investments; maintain health and legal clarity.",
    "9": "### Jupiter in 9th House ###\n*** Ranking: 9/10\n\n*** Prediction:\n- Strong for father, higher education, and dharma; fortune through wisdom and long travels.\n- One of the best placements; natural 9th house strength.\n\n*** Opportunities:\n- Excellent fortune and respect from father and guru.\n- Success in higher education, law, religion, and long travels.\n- Raja Yoga potential; fame through wisdom and righteousness.\n\n*** Challenges:\n- Over-optimism or over-religious zeal; possible weight issues.\n- Need for humility despite good fortune.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; honour father and guru.\n- Practice humility and share wisdom with others.",
    "10": "### Jupiter in 10th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Career in teaching, law, or advisory roles; reputation and authority supported.\n- Strong for career and reputation.\n\n*** Opportunities:\n- Success in teaching, law, administration, or advisory roles.\n- Strong reputation and authority; gains through career and wisdom.\n- Support from superiors and government.\n\n*** Challenges:\n- Relationship with father may need attention; possible over-commitment.\n- Need for balance between career and family.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; maintain humility in career.\n- Honour father and maintain good relations with superiors.",
    "11": "### Jupiter in 11th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Gains, friends, and fulfillment of desires supported; income and network expand positively.\n- Strong for gains and network.\n\n*** Opportunities:\n- Steady gains and strong network; fulfillment of desires.\n- Success through friends, elder support, and good fortune.\n- Income growth and expansion of influence.\n\n*** Challenges:\n- Over-spending or over-optimism in gains; possible weight issues.\n- Need for discrimination in friends and expenses.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; use gains for good causes.\n- Avoid over-indulgence and choose friends wisely.",
    "12": "### Jupiter in 12th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Spirituality, expenses, and foreign lands influenced; philanthropy and inner growth indicated.\n- Mixed results; interest in spirituality and charity.\n\n*** Opportunities:\n- Spiritual growth and interest in meditation or foreign travel.\n- Gains through charity, hospitals, or spiritual institutions.\n- Liberation through wisdom and reduced attachment.\n\n*** Challenges:\n- Expenses and losses; possible confinement or litigation.\n- Over-optimism in foreign or spiritual ventures; need for caution.\n\n*** Recommendations:\n- Wear Yellow Sapphire; chant Guru Mantra; practice charity and meditation.\n- Avoid unnecessary expenses and legal issues."
  },
  "Venus": {
    "1": "### Venus in 1st House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Charm, beauty, and love for luxury; native may be artistic and attract others easily.\n- Good for personality and appeal when well placed.\n\n*** Opportunities:\n- Success in arts, fashion, or relationship-based fields.\n- Attractive personality and good relations; comfort and luxury.\n- Gains through creativity and diplomacy.\n\n*** Challenges:\n- Over-indulgence or laziness; possible kidney or hormonal issues.\n- Need for balance between luxury and discipline.\n\n*** Recommendations:\n- Wear Diamond or White Sapphire; chant Shukra Mantra or Lakshmi Mantra.\n- Practice moderation and avoid over-indulgence.",
    "2": "### Venus in 2nd House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Wealth, family, and speech supported; gains through arts, vehicles, or luxury goods possible.\n- Strong for wealth and family.\n\n*** Opportunities:\n- Steady wealth through arts, vehicles, or luxury; strong family support.\n- Good speech and attractive family; accumulation of comforts.\n- Success in family business or creative ventures.\n\n*** Challenges:\n- Over-spending on luxury; possible dental or throat issues.\n- Speech may be too pleasing or manipulative; need for honesty.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; use wealth for stability.\n- Avoid excessive luxury spending.",
    "3": "### Venus in 3rd House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Siblings, short travels, and creativity strengthened; comfort and happiness from younger siblings.\n- Good for communication and local success.\n\n*** Opportunities:\n- Success in arts, short travels, and sibling relations.\n- Gains through creative communication or trade; comfortable relations.\n- Good relations with neighbours and younger siblings.\n\n*** Challenges:\n- Indulgence in short travels or pleasure; possible skin or throat issues.\n- Sibling relations may need balance; avoid laziness.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; support siblings.\n- Balance pleasure with responsibility in short travels.",
    "4": "### Venus in 4th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Happiness from mother, property, and vehicles; comfortable home and domestic peace.\n- Strong for domestic happiness.\n\n*** Opportunities:\n- Comfortable home and vehicles; happiness from mother and family.\n- Success in property, real estate, or vehicles; domestic harmony.\n- Attractive home and good relations with mother.\n\n*** Challenges:\n- Over-attachment to comfort; possible urinary or hormonal issues.\n- Property or vehicle matters may involve expense; need for moderation.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; honour mother and home.\n- Avoid over-spending on property and vehicles.",
    "5": "### Venus in 5th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Romance, children, and creative arts supported; speculative gains and pleasure from children.\n- Strong for 5th house matters.\n\n*** Opportunities:\n- Creative and romantic success; intelligent and attractive children.\n- Gains through speculation, arts, or entertainment; good fortune.\n- Pleasure from creativity and progeny.\n\n*** Challenges:\n- Over-indulgence in romance or speculation; possible reproductive issues.\n- Need for balance in creative and romantic pursuits.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; nurture children with love.\n- Avoid reckless speculation and over-romanticism.",
    "6": "### Venus in 6th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Health or enemy issues possible but also support in service; balance in routine and relationships needed.\n- Mixed results for 6th house.\n\n*** Opportunities:\n- Victory over enemies through diplomacy; success in arts or beauty sector.\n- Service in healing or creative fields; recovery with care.\n- Gains through routine work or service.\n\n*** Challenges:\n- Health issues related to urinary, skin, or hormonal system.\n- Enemies may use charm or manipulation; need for caution.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; maintain health discipline.\n- Avoid indulgence and maintain boundaries with opponents.",
    "7": "### Venus in 7th House ###\n*** Ranking: 9/10\n\n*** Prediction:\n- Favorable for marriage and partnerships; spouse may be attractive and relationship-oriented.\n- One of the best placements for marriage.\n\n*** Opportunities:\n- Harmonious marriage and attractive spouse; success in partnership.\n- Gains through spouse and business partnership; good fortune in love.\n- Respect and comfort in relationship.\n\n*** Challenges:\n- Over-indulgence in partnership; possible kidney or hormonal issues.\n- Need for loyalty and balance in marriage.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; respect and cherish spouse.\n- Practice fidelity and avoid over-indulgence.",
    "8": "### Venus in 8th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Interest in occult, longevity, and transformation; inheritance or spouse's wealth may be significant.\n- Mixed results; gains through spouse or inheritance.\n\n*** Opportunities:\n- Inheritance or gains through spouse; interest in occult or research.\n- Transformation through relationships; possible long life with care.\n- Success in research or behind-the-scenes creative work.\n\n*** Challenges:\n- Health issues related to reproductive or urinary system.\n- Inheritance disputes or delays; possible loss in partnership.\n\n*** Recommendations:\n- Wear Diamond with care; chant Shukra Mantra; legal clarity in inheritance.\n- Maintain health and avoid risky relationships.",
    "9": "### Venus in 9th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Fortune, father, and higher learning supported; luck through arts, travel, or spirituality.\n- Good for fortune and philosophy.\n\n*** Opportunities:\n- Good fortune and support from father; success in arts or long travels.\n- Gains through spirituality, teaching, or foreign connections.\n- Harmonious relationship with father and guru.\n\n*** Challenges:\n- Over-indulgence in travel or philosophy; possible moral flexibility.\n- Need for sincerity in spiritual and philosophical pursuits.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; honour father and guru.\n- Practice sincerity in dharma and avoid excess.",
    "10": "### Venus in 10th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Career in arts, fashion, or diplomacy; reputation through charm and creativity.\n- Good for career and public image.\n\n*** Opportunities:\n- Success in arts, fashion, diplomacy, or entertainment.\n- Strong reputation and gains through career; support from superiors.\n- Comfort and recognition in profession.\n\n*** Challenges:\n- Relationship with mother may need attention; possible over-focus on image.\n- Need for substance behind charm in career.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; balance image with competence.\n- Honour mother and maintain professional ethics.",
    "11": "### Venus in 11th House ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Gains, friends, and desires supported; income and social circle expand pleasantly.\n- Strong for gains and network.\n\n*** Opportunities:\n- Steady gains and pleasant social circle; fulfillment of desires.\n- Success through friends, arts, or luxury-related ventures.\n- Income growth and comfortable lifestyle.\n\n*** Challenges:\n- Over-spending on friends or luxury; possible indulgence.\n- Need for discrimination in friends and expenses.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; use gains for stability.\n- Avoid excessive spending and maintain genuine friendships.",
    "12": "### Venus in 12th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses, solitude, and spirituality influenced; comfort in private or spiritual pursuits.\n- Mixed results; interest in solitude and spirituality.\n\n*** Opportunities:\n- Spiritual growth and comfort in solitude; gains through foreign or spiritual work.\n- Interest in meditation or charitable arts; liberation through reduced attachment.\n- Possible gains through hospitals or ashrams.\n\n*** Challenges:\n- Expenses and losses; possible confinement or secret relationships.\n- Health issues related to urinary or reproductive system.\n\n*** Recommendations:\n- Wear Diamond; chant Shukra Mantra; practice charity and meditation.\n- Avoid secret affairs and unnecessary expenses."
  },
  "Saturn": {
    "1": "### Saturn in 1st House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Discipline, patience, and delayed recognition; native may be serious and hardworking.\n- Mixed results; success comes with time and effort.\n\n*** Opportunities:\n- Success through discipline and hard work; respect in later life.\n- Strong character and ability to endure; success in government or senior roles.\n- Long life with discipline and patience.\n\n*** Challenges:\n- Delayed success and possible health issues (bones, skin, knees).\n- Loneliness or pessimism; need for optimism and social connection.\n\n*** Recommendations:\n- Wear Blue Sapphire or Amethyst (after consultation); chant Shani Mantra.\n- Practice patience and maintain health; avoid isolation.",
    "2": "### Saturn in 2nd House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Family wealth and speech influenced; gains may come late but through persistence and discipline.\n- Mixed results for wealth and family.\n\n*** Opportunities:\n- Steady wealth through discipline and hard work; strong character.\n- Gains in later life; respect through serious speech.\n- Success through family business or government.\n\n*** Challenges:\n- Delayed financial success; possible dental or speech issues.\n- Strained family relations or pessimism; need for patience.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; save and invest wisely.\n- Maintain family harmony and avoid negative speech.",
    "3": "### Saturn in 3rd House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Distance from siblings or delays in short travels possible; hard work and courage are tested.\n- Mixed results for 3rd house matters.\n\n*** Opportunities:\n- Success through persistent effort in communication and short travels.\n- Strong will and discipline; gains through siblings in later life.\n- Victory through patience and strategy.\n\n*** Challenges:\n- Delays or distance with siblings; possible respiratory or bone issues.\n- Short travels may be delayed or difficult; need for patience.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; maintain sibling relations.\n- Avoid pessimism; work steadily toward goals.",
    "4": "### Saturn in 4th House ###\n*** Ranking: 4/10\n\n*** Prediction:\n- Challenges regarding mother or property possible; comfort may come later in life.\n- Difficult placement for 4th house matters.\n\n*** Opportunities:\n- Property and comfort through hard work and patience in later life.\n- Discipline in domestic matters; success with delay.\n- Strong character from difficult early home life.\n\n*** Challenges:\n- Strained relation with mother; property delays or disputes.\n- Domestic unhappiness or moving; possible heart or chest issues.\n\n*** Recommendations:\n- Wear Blue Sapphire only after expert consultation; chant Shani Mantra.\n- Honour mother; avoid property disputes; patience is key.",
    "5": "### Saturn in 5th House ###\n*** Ranking: 4/10\n\n*** Prediction:\n- Delay in children or responsibility; education and speculation need patience.\n- Mixed results for 5th house.\n\n*** Opportunities:\n- Children and gains through patience and discipline in later life.\n- Success in education with effort; serious and responsible children.\n- Speculation with caution can yield results.\n\n*** Challenges:\n- Delays in progeny or stress with children; possible reproductive issues.\n- Speculation may lead to losses; need for extreme caution.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; avoid speculation.\n- Nurture children with patience and discipline.",
    "6": "### Saturn in 6th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Generally good for victory over enemies and service; health may need careful management.\n- Favourable placement for 6th house.\n\n*** Opportunities:\n- Victory over enemies through patience and strategy.\n- Success in service, health sector, or routine work; good recovery.\n- Gains through discipline and dealing with opponents.\n\n*** Challenges:\n- Health issues related to bones, skin, or chronic conditions.\n- Service may be draining; need for rest and balance.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; maintain health.\n- Avoid overwork; practice patience in service.",
    "7": "### Saturn in 7th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Marriage and partnerships influenced; spouse may be older or serious; delays in marriage possible.\n- Mixed results for partnership.\n\n*** Opportunities:\n- Stable and responsible spouse; success in partnership with patience.\n- Gains through spouse or business partnership in later life.\n- Long-lasting relationship with effort.\n\n*** Challenges:\n- Delays in marriage; spouse may have health or age-related issues.\n- Coldness or distance in relationship; need for warmth and communication.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; practice warmth in marriage.\n- Support spouse and avoid criticism; patience in partnership.",
    "8": "### Saturn in 8th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Focus on longevity, transformation, and occult; inheritance or long life with discipline.\n- Mixed results; interest in research and occult.\n\n*** Opportunities:\n- Long life with discipline; success in research or occult.\n- Inheritance or gains through transformation in later life.\n- Interest in astrology, healing, or serious study.\n\n*** Challenges:\n- Health issues or stress related to longevity; possible inheritance delays.\n- Transformation may be difficult; need for patience and acceptance.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani and Maha Mrityunjaya Mantra.\n- Maintain health; legal clarity in inheritance; avoid obsession with death.",
    "9": "### Saturn in 9th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Distance from father or delays in higher education possible; dharma and long travels need patience.\n- Mixed results for 9th house.\n\n*** Opportunities:\n- Success in higher education and fortune through patience and discipline.\n- Strong sense of dharma and justice; gains in later life.\n- Long travels and foreign connection with delay.\n\n*** Challenges:\n- Strained relation with father; delays in education or travel.\n- Pessimism in philosophy; need for faith and optimism.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; honour father.\n- Practice faith and patience in spiritual matters.",
    "10": "### Saturn in 10th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Career built through hard work and discipline; authority and reputation come with time.\n- Good for career with delay.\n\n*** Opportunities:\n- Strong career and authority through hard work; success in government or senior roles.\n- Respect and reputation in later life; gains through discipline.\n- Leadership in administrative or technical fields.\n\n*** Challenges:\n- Delayed career success; possible conflict with mother or authority.\n- Stress and responsibility; need for balance and health.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; patience in career.\n- Honour mother and maintain health under stress.",
    "11": "### Saturn in 11th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Gains and friends supported, often after effort; income may be steady but delayed.\n- Mixed results for gains.\n\n*** Opportunities:\n- Steady gains through discipline and senior friends; success in later life.\n- Fulfillment of desires with patience; strong network in senior circles.\n- Income growth through hard work and persistence.\n\n*** Challenges:\n- Delayed gains; possible coldness with friends or in groups.\n- Need for patience and avoiding pessimism.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; use gains wisely.\n- Maintain friendships with effort and warmth.",
    "12": "### Saturn in 12th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Expenses, solitude, and spirituality influenced; discipline in spiritual or secluded life.\n- Mixed results; interest in solitude and spirituality.\n\n*** Opportunities:\n- Spiritual growth and interest in meditation or secluded work.\n- Gains through foreign lands, hospitals, or charitable work in later life.\n- Liberation through discipline and reduced attachment.\n\n*** Challenges:\n- Expenses and losses; possible confinement or litigation.\n- Loneliness or health issues; need for balance and connection.\n\n*** Recommendations:\n- Wear Blue Sapphire (with guidance); chant Shani Mantra; practice charity.\n- Avoid isolation; maintain health and legal clarity."
  },
  "Rahu": {
    "1": "### Rahu in 1st House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Ambition, unconventional personality, and desire for fame; native may be innovative but restless.\n- Mixed results; strong drive when channeled well.\n\n*** Opportunities:\n- Success through innovation and unconventional means; fame and ambition.\n- Strong desire to achieve; success in technology or foreign-related fields.\n- Ability to influence masses and adapt to change.\n\n*** Challenges:\n- Restlessness and identity confusion; possible skin or nervous issues.\n- Over-ambition or unethical shortcuts; need for grounding.\n\n*** Recommendations:\n- Wear Hessonite or Gomed (after consultation); chant Rahu Mantra.\n- Practice ethics and meditation; avoid obsession with fame.",
    "2": "### Rahu in 2nd House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Wealth and family influenced; sudden gains or unconventional sources of income possible.\n- Mixed results for wealth and speech.\n\n*** Opportunities:\n- Gains through innovation, technology, or unconventional business.\n- Strong desire for wealth; success with strategy and adaptability.\n- Family may have foreign or unconventional connections.\n\n*** Challenges:\n- Unstable wealth or unethical gains; possible speech or dental issues.\n- Family disputes or confusion; need for honesty in financial matters.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; earn ethically.\n- Maintain family harmony and avoid speculative speech.",
    "3": "### Rahu in 3rd House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Courage and short travels strengthened; siblings or communication may have unusual aspects.\n- Good for innovation in communication and travel.\n\n*** Opportunities:\n- Success in media, technology, or short travels; strong sibling support in unusual ways.\n- Gains through communication and courage; adaptability in local matters.\n- Interest in writing, media, or technical communication.\n\n*** Challenges:\n- Unreliable or unconventional siblings; possible respiratory or nervous issues.\n- Restlessness in short travels; need for focus.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; maintain sibling relations.\n- Use innovation constructively; avoid gossip.",
    "4": "### Rahu in 4th House ###\n*** Ranking: 4/10\n\n*** Prediction:\n- Restlessness regarding home and mother; property matters may be unconventional.\n- Difficult for domestic peace and property.\n\n*** Opportunities:\n- Property through unconventional means or foreign connection.\n- Success in technology at home or real estate with innovation.\n- Change of residence or property improvement with effort.\n\n*** Challenges:\n- Domestic unrest or strained relation with mother; property disputes.\n- Mental restlessness at home; possible heart or chest issues.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; honour mother.\n- Avoid property disputes; create peaceful routine at home.",
    "5": "### Rahu in 5th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Children, creativity, and speculation influenced; unconventional intelligence or speculative gains.\n- Mixed results for 5th house.\n\n*** Opportunities:\n- Success in technology, speculation, or unconventional creativity.\n- Intelligent but unconventional children; gains through innovation.\n- Interest in astrology, research, or technical speculation.\n\n*** Challenges:\n- Stress with children or in speculation; possible reproductive issues.\n- Unethical speculation or confusion in creative matters; need for caution.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; avoid reckless speculation.\n- Nurture children with stability and ethics.",
    "6": "### Rahu in 6th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Help in overcoming enemies through strategy; health may need attention to unusual issues.\n- Generally good for 6th house when channeled.\n\n*** Opportunities:\n- Victory over enemies through strategy and innovation.\n- Success in health sector, technology, or service; good recovery with modern methods.\n- Gains through litigation or dealing with opponents.\n\n*** Challenges:\n- Unusual or chronic health issues; possible skin or digestive problems.\n- Enemies may be hidden or unconventional; need for caution.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; maintain health.\n- Avoid unnecessary litigation; use strategy ethically.",
    "7": "### Rahu in 7th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Marriage and partnerships influenced; spouse may be from different background; partnerships need understanding.\n- Mixed results for partnership.\n\n*** Opportunities:\n- Spouse from foreign or different culture; success in business partnership with innovation.\n- Gains through spouse or unconventional partnership; travel with partner.\n- Success in legal or contractual matters with strategy.\n\n*** Challenges:\n- Delays or confusion in marriage; spouse may have unusual traits or health issues.\n- Partnership may involve deception or restlessness; need for trust.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; build trust in partnership.\n- Avoid suspicion; support spouse's background and growth.",
    "8": "### Rahu in 8th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Interest in occult, transformation, and sudden events; inheritance or research may be significant.\n- Mixed results; strong interest in occult and research.\n\n*** Opportunities:\n- Success in research, occult, or technology; inheritance or sudden gains.\n- Interest in astrology, transformation, or healing; gains through spouse.\n- Ability to handle crisis and transformation.\n\n*** Challenges:\n- Sudden events or health issues; possible inheritance disputes.\n- Obsession with occult or death; need for balance and health.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu and Maha Mrityunjaya Mantra.\n- Avoid obsession with occult; maintain health and legal clarity.",
    "9": "### Rahu in 9th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Father, higher education, and dharma influenced; unconventional beliefs or foreign connections.\n- Mixed results for fortune and philosophy.\n\n*** Opportunities:\n- Success in foreign education or travel; gains through unconventional philosophy.\n- Father may have foreign connection; interest in diverse beliefs.\n- Fortune through technology, travel, or innovation.\n\n*** Challenges:\n- Strained relation with father or confusion in beliefs; possible religious restlessness.\n- Over-reliance on luck or unconventional wisdom; need for grounding.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; honour father.\n- Practice core dharma and avoid extreme or unethical beliefs.",
    "10": "### Rahu in 10th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Ambition in career and reputation; success through technology or unconventional means.\n- Good for career with innovation and drive.\n\n*** Opportunities:\n- Success in technology, media, or unconventional career; fame and ambition.\n- Strong reputation through innovation; gains through authority and strategy.\n- Leadership in new or foreign-related fields.\n\n*** Challenges:\n- Conflict with mother or authority; possible unethical shortcuts.\n- Stress from ambition and public scrutiny; need for ethics.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; maintain ethics in career.\n- Honour mother and avoid shortcuts to success.",
    "11": "### Rahu in 11th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains, friends, and desires supported; income through innovation or foreign connections.\n- Good for gains and network.\n\n*** Opportunities:\n- Gains through friends, technology, or foreign connections.\n- Fulfillment of desires with strategy; strong network in unconventional circles.\n- Income through innovation, export, or group ventures.\n\n*** Challenges:\n- Unreliable or self-serving friends; possible sudden gains and losses.\n- Need for discrimination in friends and desires.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; choose friends wisely.\n- Use gains ethically and avoid get-rich-quick schemes.",
    "12": "### Rahu in 12th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses, foreign lands, and spirituality influenced; interest in mysticism or foreign travel.\n- Mixed results; interest in solitude and spirituality.\n\n*** Opportunities:\n- Success in foreign lands, spirituality, or charitable work.\n- Gains through hospitals, ashrams, or behind-the-scenes work.\n- Liberation through reduced attachment and spiritual practice.\n\n*** Challenges:\n- Expenses and losses; possible confinement or secret issues.\n- Confusion in spirituality or foreign matters; need for clarity.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); chant Rahu Mantra; practice clear spiritual discipline.\n- Avoid unnecessary expenses and secretive behaviour."
  },
  "Ketu": {
    "1": "### Ketu in 1st House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Spiritual or detached personality; native may be introspective and less materialistic.\n- Mixed results; interest in spirituality and detachment.\n\n*** Opportunities:\n- Spiritual growth and interest in meditation or philosophy.\n- Success in research, healing, or behind-the-scenes work.\n- Liberation through reduced ego and material attachment.\n\n*** Challenges:\n- Identity confusion or lack of confidence; possible skin or nervous issues.\n- Detachment may affect relationships; need for balance.\n\n*** Recommendations:\n- Wear Cat's Eye or Lehsunia (after consultation); chant Ketu Mantra.\n- Practice grounding and balance spirituality with practical life.",
    "2": "### Ketu in 2nd House ###\n*** Ranking: 4/10\n\n*** Prediction:\n- Wealth and family influenced; gains may be through spirituality or unexpected sources.\n- Mixed results for wealth and speech.\n\n*** Opportunities:\n- Gains through spirituality, research, or unexpected sources.\n- Detachment from wealth can lead to unexpected gains; interest in minimalism.\n- Family may have spiritual or unconventional connection.\n\n*** Challenges:\n- Instability in wealth or family; possible speech or dental issues.\n- Loss or detachment from family; need for balance and presence.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; maintain family connection.\n- Use wealth for good causes; avoid excessive detachment.",
    "3": "### Ketu in 3rd House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Distance from siblings or short travels possible; courage may be inner rather than outward.\n- Mixed results for 3rd house.\n\n*** Opportunities:\n- Success through inner courage and spiritual communication.\n- Gains through writing, research, or short travels with spiritual angle.\n- Siblings may have spiritual or unconventional path.\n\n*** Challenges:\n- Distance or detachment from siblings; possible respiratory or nervous issues.\n- Short travels may be delayed or spiritually oriented; need for balance.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; maintain sibling relations.\n- Balance inner growth with practical communication.",
    "4": "### Ketu in 4th House ###\n*** Ranking: 4/10\n\n*** Prediction:\n- Detachment from home or mother possible; spiritual comfort may replace material comfort.\n- Difficult for domestic peace and property.\n\n*** Opportunities:\n- Spiritual comfort and interest in meditation at home.\n- Property or home through unexpected or spiritual means; minimalism.\n- Liberation from material attachment to home.\n\n*** Challenges:\n- Strained relation with mother or domestic unrest; property issues.\n- Mental or emotional detachment at home; possible heart or chest issues.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; honour mother.\n- Create peaceful and simple home environment.",
    "5": "### Ketu in 5th House ###\n*** Ranking: 4/10\n\n*** Prediction:\n- Children, creativity, and past life influenced; speculation may be risky; spirituality favored.\n- Mixed results for 5th house.\n\n*** Opportunities:\n- Spiritual or intellectual children; success in research or speculative fields with caution.\n- Interest in past life or spiritual creativity; gains through intuition.\n- Detachment in speculation can reduce losses.\n\n*** Challenges:\n- Delays or stress with children; possible reproductive or stomach issues.\n- Speculation often leads to losses; need for extreme caution.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; avoid speculation.\n- Nurture children with spiritual and emotional presence.",
    "6": "### Ketu in 6th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Help in overcoming enemies and health; service with detachment or healing abilities.\n- Generally good for 6th house.\n\n*** Opportunities:\n- Victory over enemies through strategy and detachment.\n- Success in healing, research, or service; good recovery with alternative methods.\n- Gains through service and dealing with opponents with calm.\n\n*** Challenges:\n- Unusual or chronic health issues; possible skin or digestive problems.\n- Service may feel draining; need for rest and spiritual recharge.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; maintain health.\n- Practice detachment in service without coldness.",
    "7": "### Ketu in 7th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Marriage and partnerships influenced; spouse may be spiritual; partnership may have karmic element.\n- Mixed results for partnership.\n\n*** Opportunities:\n- Spouse may be spiritual or from different background; karmic partnership.\n- Success in partnership with spiritual or research angle.\n- Gains through spouse with delay or transformation.\n\n*** Challenges:\n- Delays or detachment in marriage; spouse may have health or spiritual issues.\n- Partnership may involve sacrifice or confusion; need for clarity and commitment.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; build commitment in partnership.\n- Support spouse's spiritual growth; avoid excessive detachment.",
    "8": "### Ketu in 8th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Strong interest in occult, longevity, and transformation; research and mysticism indicated.\n- Good for 8th house matters when channeled.\n\n*** Opportunities:\n- Success in occult, research, or transformation; interest in astrology and healing.\n- Long life with spiritual practice; gains through inheritance or research.\n- Ability to understand hidden matters and transformation.\n\n*** Challenges:\n- Obsession with occult or death; possible sudden events or health issues.\n- Inheritance may be delayed or involve disputes; need for balance.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu and Maha Mrityunjaya Mantra.\n- Use occult knowledge for healing; avoid obsession.",
    "9": "### Ketu in 9th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Father, higher education, and dharma influenced; spiritual or unconventional wisdom.\n- Mixed results for fortune and philosophy.\n\n*** Opportunities:\n- Success in spiritual or philosophical education; unconventional guru.\n- Fortune through spirituality and detachment; interest in diverse beliefs.\n- Long travels for spiritual or research purposes.\n\n*** Challenges:\n- Strained relation with father or confusion in dharma; possible religious detachment.\n- Over-spiritualisation may affect practical fortune; need for balance.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; honour father and guru.\n- Balance spirituality with practical dharma.",
    "10": "### Ketu in 10th House ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Career may be behind the scenes or spiritual; reputation through sacrifice or service.\n- Mixed results for career and reputation.\n\n*** Opportunities:\n- Success in research, healing, or spiritual career; reputation through service.\n- Gains through behind-the-scenes or unconventional profession.\n- Respect through sacrifice and detachment from fame.\n\n*** Challenges:\n- Delayed or low-profile career; possible conflict with mother or authority.\n- Stress from lack of recognition; need for patience and inner satisfaction.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; find satisfaction in service.\n- Honour mother; avoid craving for fame.",
    "11": "### Ketu in 11th House ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Gains and friends supported, often through unconventional means; wishes may be spiritual.\n- Mixed results for gains and network.\n\n*** Opportunities:\n- Gains through spirituality, research, or unexpected sources.\n- Fulfillment of desires with detachment; friends in spiritual or research circles.\n- Income through healing, export, or unconventional ventures.\n\n*** Challenges:\n- Unreliable or few friends; possible sudden gains and losses.\n- Wishes may be delayed or spiritual; need for patience.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; use gains for good causes.\n- Maintain few but genuine friends; avoid material obsession.",
    "12": "### Ketu in 12th House ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Strong for spirituality, expenses, and foreign lands; compassion and liberation are themes.\n- Good for 12th house; natural placement for Ketu.\n\n*** Opportunities:\n- Strong spiritual growth and interest in meditation or foreign travel.\n- Success in ashrams, hospitals, or charitable work; liberation through detachment.\n- Gains through foreign lands or spiritual institutions.\n\n*** Challenges:\n- Expenses and losses; possible confinement or separation.\n- Over-detachment may affect practical life; need for balance.\n\n*** Recommendations:\n- Wear Cat's Eye (with guidance); chant Ketu Mantra; practice charity and meditation.\n- Balance spirituality with practical responsibilities."
  }
}
