{
  "Ketu": {
    "summary": "Ketu Mahadasha brings a period of spiritual focus, detachment from material pursuits, and interest in mysticism or healing. Past karmas may surface; inner growth and letting go are key themes. Care with health and sudden changes is advised."
  },
  "Venus": {
    "summary": "Venus Mahadasha focuses on relationships, beauty, luxury, and artistic expression. A generally favorable period for love, marriage, and material comforts when Venus is well placed. Creativity, diplomacy, and partnerships flourish."
  },
  "Sun": {
    "summary": "Sun Mahadasha emphasizes leadership, authority, and self-confidence. Career advancement, respect from elders, and dealings with government or administration are highlighted. Balance ego and maintain humility for best results."
  },
  "Moon": {
    "summary": "Moon Mahadasha brings emotional sensitivity, mother-related matters, and changes in mood or residence. Travel, creativity, and public dealings may increase. Emotional stability and care for mental health are important."
  },
  "Mars": {
    "summary": "Mars Mahadasha emphasizes courage, energy, and initiative. Property, technical work, sports, or defence-related fields may be prominent. Channel aggression constructively; avoid impulsiveness in legal or partnership matters."
  },
  "Rahu": {
    "summary": "Rahu Mahadasha creates sudden changes, ambition, and foreign connections. Material gains mixed with confusion; technology, politics, or unconventional paths may emerge. Stay grounded and avoid risky shortcuts."
  },
  "Jupiter": {
    "summary": "Jupiter Mahadasha favors wisdom, higher education, children, and fortune. Generally auspicious for dharma, spirituality, and expansion. Gains through elders, travel, and righteousness when Jupiter is strong."
  },
  "Saturn": {
    "summary": "Saturn Mahadasha brings discipline, delays, hard work, and karma. Long-term gains through patience; health and older people may need attention. Service, structure, and persistence lead to eventual rewards."
  },
  "Mercury": {
    "summary": "Mercury Mahadasha supports communication, business, education, and intellect. Sharp thinking, trade, writing, or accounts may flourish. Balance mental restlessness with focus for best outcomes."
  }
}
