{
  "1": {
    "1": "### Lord of 1st House (Aries) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Strong self, courage, and initiative; potential for leadership and good physical energy.\n\n*** Opportunities:\n- Leadership abilities and respect (Raja Yoga potential).\n- Good health and vitality; success through self-initiative.\n- Pioneer spirit and ability to influence others.\n\n*** Challenges:\n- Ego or impulsiveness if Mars is afflicted.\n- Possible tension with authority; need for patience.\n\n*** Recommendations:\n- Wear Red Coral to strengthen Mars; recite Hanuman Chalisa or Mangal Mantra for courage and discipline.",
    "2": "### Lord of 1st House (Taurus) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Steady personality, love for comfort and beauty; wealth and stability are important.\n\n*** Opportunities:\n- Wealth and financial stability (Dhana Yoga potential).\n- Strong family values and material comfort.\n- Success through persistence and aesthetics.\n\n*** Challenges:\n- Stubbornness or over-attachment to comfort.\n- Delays in gains if Venus is afflicted.\n\n*** Recommendations:\n- Wear Diamond or White Sapphire to enhance Venus; recite Shukra Mantra for balance and prosperity.",
    "3": "### Lord of 1st House (Gemini) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Quick mind, curiosity, and communication; versatile and interested in learning.\n\n*** Opportunities:\n- Success in communication, trade, or writing (Budh-Aditya Yoga potential).\n- Multiple skills and adaptability.\n- Gains through intellect and siblings.\n\n*** Challenges:\n- Restlessness or lack of focus; nervous stress.\n- Communication issues if Mercury is afflicted.\n\n*** Recommendations:\n- Wear Emerald to strengthen Mercury; recite Budh Mantra or Vishnu Mantra for clarity and focus.",
    "4": "### Lord of 1st House (Cancer) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Emotional and protective nature; strong attachment to home, mother, and family roots.\n\n*** Opportunities:\n- Happiness from mother and property (Chandra-Mangal Yoga potential).\n- Emotional intelligence and public appeal.\n- Success in real estate or nurturing fields.\n\n*** Challenges:\n- Mood swings or over-sensitivity.\n- Need for emotional security and balance.\n\n*** Recommendations:\n- Wear Pearl or Moonstone to enhance Moon; recite Chandra Mantra or Gayatri Mantra for emotional stability.",
    "5": "### Lord of 1st House (Leo) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Dignified, proud, and creative; seeks recognition and has a generous heart.\n\n*** Opportunities:\n- Leadership and respect (Raja Yoga, Surya in own sign).\n- Success in creative or authoritative fields.\n- Good health and vitality when Sun is strong.\n\n*** Challenges:\n- Ego or arrogance if Sun is afflicted.\n- Tension with father or authority figures.\n\n*** Recommendations:\n- Wear Ruby or Red Coral to strengthen Sun; recite Surya Mantra or Gayatri Mantra for humility and strength.",
    "6": "### Lord of 1st House (Virgo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Analytical, service-oriented, and detail-focused; health and routine may be important.\n\n*** Opportunities:\n- Success in service, health, or analytical fields.\n- Victory over enemies through strategy.\n- Gains through discipline and careful planning.\n\n*** Challenges:\n- Over-criticism or anxiety; digestive or nervous issues.\n- Need for balance between service and self-care.\n\n*** Recommendations:\n- Wear Emerald to strengthen Mercury; recite Budh Mantra for calm and clarity.",
    "7": "### Lord of 1st House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Balanced, diplomatic, and relationship-oriented; values harmony and partnership.\n\n*** Opportunities:\n- Success in partnership and public life (Veenna Yoga potential).\n- Charm and ability to create balance.\n- Gains through spouse or diplomacy.\n\n*** Challenges:\n- Indecision or over-dependence on others.\n- Need for assertiveness and self-identity.\n\n*** Recommendations:\n- Wear Diamond to strengthen Venus; recite Shukra Mantra for confidence and harmony.",
    "8": "### Lord of 1st House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Intense, secretive, and transformative; deep interest in occult or hidden matters.\n\n*** Opportunities:\n- Success in research, occult, or transformation.\n- Inheritance or gains through depth and strategy.\n- Ability to handle crisis and change.\n\n*** Challenges:\n- Obsession or suspicion; possible health or inheritance issues.\n- Need for openness and trust.\n\n*** Recommendations:\n- Wear Red Coral to strengthen Mars; recite Mangal Mantra; avoid obsession with secrecy.",
    "9": "### Lord of 1st House (Sagittarius) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Philosophical, optimistic, and freedom-loving; faith and higher learning shape the personality.\n\n*** Opportunities:\n- Fortune and respect (Raja Yoga, Guru in own sign).\n- Success in education, law, or religion.\n- Long travels and wisdom.\n\n*** Challenges:\n- Over-optimism or over-religious zeal.\n- Need for practicality and grounding.\n\n*** Recommendations:\n- Wear Yellow Sapphire to strengthen Jupiter; recite Guru Mantra or Vishnu Mantra for balance.",
    "10": "### Lord of 1st House (Capricorn) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Ambitious, disciplined, and responsible; builds reputation through hard work.\n\n*** Opportunities:\n- Strong career and authority (Shasha Yoga potential).\n- Success through patience and discipline.\n- Respect in later life.\n\n*** Challenges:\n- Delayed success or pessimism; possible bone or skin issues.\n- Need for optimism and work-life balance.\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation) or Amethyst; recite Shani Mantra for patience and health.",
    "11": "### Lord of 1st House (Aquarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Independent, innovative, and humanitarian; friends and ideals are central to identity.\n\n*** Opportunities:\n- Success through innovation and humanitarian work.\n- Strong network and unconventional gains.\n- Ability to lead through ideas.\n\n*** Challenges:\n- Detachment or unpredictability; need for emotional connection.\n- Possible delays or instability in gains.\n\n*** Recommendations:\n- Wear Blue Sapphire or Hessonite (with guidance); recite Shani or Rahu Mantra for grounding.",
    "12": "### Lord of 1st House (Pisces) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Compassionate, imaginative, and spiritual; sensitive and drawn to the unseen.\n\n*** Opportunities:\n- Success in spirituality, arts, or healing.\n- Strong intuition and creative imagination.\n- Gains through compassion and service.\n\n*** Challenges:\n- Over-sensitivity or escapism; need for boundaries.\n- Possible confusion or lack of direction.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru Mantra or Chandra Mantra for clarity and protection."
  },
  "2": {
    "1": "### Lord of 2nd House (Aries) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Wealth through initiative, courage, or leadership; family may be active or assertive.\n\n*** Opportunities:\n- Potential for wealth through property or technical work (Dhana Yoga).\n- Strong speech and ability to defend family.\n\n*** Challenges:\n- Financial instability due to impulsiveness (Shakata Yoga).\n- Harsh speech or disputes affecting family.\n\n*** Recommendations:\n- Wear Red Coral to strengthen Mars; recite Mangal Mantra. Practice moderation in speech and spending.",
    "2": "### Lord of 2nd House (Taurus) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Steady accumulation of wealth and assets; strong family values and speech that builds security.\n\n*** Opportunities:\n- Wealth and financial stability (Dhana Yoga).\n- Respectable position through perseverance (Shasha Yoga).\n- Family prosperity and comfortable speech.\n\n*** Challenges:\n- Stubbornness in financial matters; over-attachment to possessions.\n\n*** Recommendations:\n- Wear Diamond or White Sapphire to enhance Venus; recite Shukra Mantra for overall well-being and clarity.",
    "3": "### Lord of 2nd House (Gemini) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Wealth through communication, trade, or siblings; family and savings may fluctuate.\n\n*** Opportunities:\n- Gains through trade, writing, or intellect (Budh related Yogas).\n- Multiple sources of income and good communication.\n\n*** Challenges:\n- Financial instability due to changing plans; communication issues.\n- Need for discipline in savings.\n\n*** Recommendations:\n- Wear Emerald to strengthen Mercury; recite Gayatri Mantra for clarity and financial discipline.",
    "4": "### Lord of 2nd House (Cancer) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Wealth linked to mother, property, or emotions; family provides emotional and material support.\n\n*** Opportunities:\n- Wealth through property, mother, or emotional intelligence.\n- Strong family support and accumulation with care.\n\n*** Challenges:\n- Mood affecting finances; possible property or family disputes.\n\n*** Recommendations:\n- Wear Pearl or Moonstone to enhance Moon; recite Chandra Mantra for emotional and financial stability.",
    "5": "### Lord of 2nd House (Leo) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Wealth through creativity, children, or speculation; family reputation and pride in assets.\n\n*** Opportunities:\n- Potential for wealth and respect (Raja Yoga, Dhana Yoga).\n- Gains through creative or speculative ventures.\n\n*** Challenges:\n- Financial instability due to over-speculation or ego.\n- Delays in gains if Sun is afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral to strengthen Sun; recite Surya or Gayatri Mantra for discipline and clarity.",
    "6": "### Lord of 2nd House (Virgo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Wealth through service, health sector, or careful management; savings through discipline.\n\n*** Opportunities:\n- Gains through service, accounts, or health-related work.\n- Careful accumulation and victory over financial obstacles.\n\n*** Challenges:\n- Anxiety over wealth; health expenses or enemy-related losses.\n\n*** Recommendations:\n- Wear Emerald to strengthen Mercury; recite Budh Mantra for calm and prudent financial decisions.",
    "7": "### Lord of 2nd House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Wealth through partnership or spouse; family and assets benefit from balance and diplomacy.\n\n*** Opportunities:\n- Wealth and stability through spouse or partnership (Veenna Yoga).\n- Gains through diplomacy and balanced approach.\n\n*** Challenges:\n- Financial instability if partnership is strained.\n- Communication issues affecting family wealth.\n\n*** Recommendations:\n- Wear Diamond to enhance Venus; recite Shukra Mantra for partnership and financial harmony.",
    "8": "### Lord of 2nd House (Scorpio) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Wealth through inheritance, research, or transformation; sudden gains or losses possible.\n\n*** Opportunities:\n- Inheritance or gains through research and transformation.\n- Ability to recover from financial setbacks.\n\n*** Challenges:\n- Financial instability due to sudden events (Shakata Yoga).\n- Inheritance disputes or delays; secrecy in wealth.\n\n*** Recommendations:\n- Wear Red Coral to strengthen Mars; recite Maha Mrityunjaya Mantra; ensure legal clarity in inheritance.",
    "9": "### Lord of 2nd House (Sagittarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Wealth through father, higher education, or long travels; fortune supports family wealth.\n\n*** Opportunities:\n- Potential for wealth and respect (Dhana Yoga, Guru blessings).\n- Gains through education, law, or foreign connection.\n\n*** Challenges:\n- Delays or challenges if Jupiter is retrograde; over-optimism in finances.\n\n*** Recommendations:\n- Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 2nd House (Capricorn) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Wealth through career and reputation; steady build-up of assets over time.\n\n*** Opportunities:\n- Respectable position through perseverance (Shasha Yoga).\n- Steady wealth through discipline and career.\n\n*** Challenges:\n- Financial instability or delays (Saturn retrograde, Rahu-Ketu influences).\n- Career challenges affecting savings.\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience and stability.",
    "11": "### Lord of 2nd House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Wealth through friends, innovation, or gains; unconventional sources of income.\n\n*** Opportunities:\n- Gains through friends and innovative ventures.\n- Potential for wealth with unconventional approach.\n\n*** Challenges:\n- Financial instability; communication and relationship issues (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; choose friends and partners wisely.",
    "12": "### Lord of 2nd House (Pisces) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Wealth may flow to spirituality or expenses; compassion and imagination in financial matters.\n\n*** Opportunities:\n- Gains through spirituality, arts, or charitable work.\n- Wealth with compassion and imagination.\n\n*** Challenges:\n- Financial instability due to expenses or confusion (Shakata Yoga).\n- Delays in accumulation; need for practical planning.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity and prudent spending."
  },
  "3": {
    "1": "### Lord of 3rd House (Aries) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Bold courage, active siblings, and short travels; initiative and energy in communication.\n\n*** Opportunities:\n- Victory in competition and short travels (Mangal in 3rd).\n- Strong sibling support and gains through courage.\n\n*** Challenges:\n- Ego clashes with siblings; possible injury or haste in travel.\n\n*** Recommendations:\n- Wear Red Coral; recite Hanuman Chalisa or Mangal Mantra for discipline and sibling harmony.",
    "2": "### Lord of 3rd House (Taurus) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Steady efforts with siblings and short travels; gains through persistence in local matters.\n\n*** Opportunities:\n- Wealth and stability through persistence (Dhana Yoga).\n- Respectable gains through steady communication.\n\n*** Challenges:\n- Delays in short travels or sibling matters; need for patience.\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra for balance and Gayatri Mantra for clarity.",
    "3": "### Lord of 3rd House (Gemini) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Strong communication, many contacts, and short journeys; siblings may be intellectual.\n\n*** Opportunities:\n- Success in writing, trade, and short travels (Budh in own house).\n- Multiple skills and good sibling relations.\n\n*** Challenges:\n- Restlessness or too many interests; nervous stress.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra for focus and overall well-being.",
    "4": "### Lord of 3rd House (Cancer) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Emotional connection with siblings and short travels; home and mother influence local activities.\n\n*** Opportunities:\n- Gains through mother, property, or emotional intelligence.\n- Comfort from siblings and local network.\n\n*** Challenges:\n- Mood affecting communication or travel; over-sensitivity.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional stability.",
    "5": "### Lord of 3rd House (Leo) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Creative courage and pride in siblings; short travels for pleasure or children.\n\n*** Opportunities:\n- Leadership in local matters; gains through creativity (Raja Yoga potential).\n- Respect and success in short travels.\n\n*** Challenges:\n- Ego with siblings; delays if Sun is afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra for humility and Gayatri Mantra for clarity.",
    "6": "### Lord of 3rd House (Virgo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Service-oriented communication and health focus; siblings may help in routine matters.\n\n*** Opportunities:\n- Victory over enemies through strategy; gains through service.\n- Careful planning in communication and travel.\n\n*** Challenges:\n- Health or anxiety affecting communication; need for balance.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra for calm and overall well-being.",
    "7": "### Lord of 3rd House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Balanced relations with siblings and partners in short travels; diplomacy in local matters.\n\n*** Opportunities:\n- Gains through partnership or balanced approach (Veenna Yoga).\n- Success in diplomacy and short travels.\n\n*** Challenges:\n- Indecision or relationship instability (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for clarity and harmony.",
    "8": "### Lord of 3rd House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Deep or secretive dealings with siblings; transformation through short travels.\n\n*** Opportunities:\n- Gains through research, occult, or transformation.\n- Strong will and recovery from setbacks.\n\n*** Challenges:\n- Sibling or travel disputes; secrecy or sudden events.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra; avoid secrecy in sibling matters.",
    "9": "### Lord of 3rd House (Sagittarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Philosophical or lucky short travels; siblings may support higher learning.\n\n*** Opportunities:\n- Fortune and gains through education or travel (Guru blessings).\n- Respectable position through perseverance.\n\n*** Challenges:\n- Delays or challenges if Jupiter is retrograde; over-optimism.\n\n*** Recommendations:\n- Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 3rd House (Capricorn) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Disciplined effort in communication and short travels; siblings may be serious.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady gains with patience.\n\n*** Challenges:\n- Delays or communication issues (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience.",
    "11": "### Lord of 3rd House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Innovative communication and friends in local sphere; gains through siblings or travel.\n\n*** Opportunities:\n- Gains through friends and unconventional approach.\n- Success in groups and innovation.\n\n*** Challenges:\n- Relationship or communication instability; need for consistency.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; maintain genuine connections.",
    "12": "### Lord of 3rd House (Pisces) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Compassionate communication and spiritual short travels; siblings may be sensitive.\n\n*** Opportunities:\n- Gains through spirituality or compassionate work.\n- Intuition in communication and travel.\n\n*** Challenges:\n- Confusion or escapism; financial or communication instability.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity."
  },
  "4": {
    "1": "### Lord of 4th House (Aries) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Active home, mother may be energetic; property matters may need initiative.\n\n*** Opportunities:\n- Property through courage and initiative (Mangal in 4th).\n- Gains in real estate or technical work.\n\n*** Challenges:\n- Tension at home or with mother; property disputes.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra; honour mother and avoid property conflicts.",
    "2": "### Lord of 4th House (Taurus) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Comfortable home and stable property; mother and family provide security.\n\n*** Opportunities:\n- Wealth and domestic happiness (Dhana Yoga).\n- Respectable position through perseverance; strong mother and property.\n\n*** Challenges:\n- Stubbornness in domestic matters; over-attachment to comfort.\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for overall well-being.",
    "3": "### Lord of 4th House (Gemini) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Communicative home environment; property or vehicles may be multiple or changing.\n\n*** Opportunities:\n- Gains through communication, trade, or intellect.\n- Intellectual environment at home; multiple properties or vehicles.\n\n*** Challenges:\n- Restlessness at home; financial or property instability.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra for stability and clarity.",
    "4": "### Lord of 4th House (Cancer) ###\n*** Ranking: 9/10\n\n*** Prediction:\n- Strong emotional attachment to home and mother; property and vehicles bring comfort.\n\n*** Opportunities:\n- Excellent domestic happiness (Chandra in own house).\n- Mother and property strongly supportive; emotional security.\n\n*** Challenges:\n- Over-sensitivity or mood affecting home; need for balance.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional and domestic harmony.",
    "5": "### Lord of 4th House (Leo) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Proud of home and mother; property may be used for creativity or children.\n\n*** Opportunities:\n- Respect and success at home (Raja Yoga potential).\n- Gains through property and creative use of assets.\n\n*** Challenges:\n- Ego at home or with mother; delays if Sun is afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility.",
    "6": "### Lord of 4th House (Virgo) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Service or health focus at home; property managed with care and detail.\n\n*** Opportunities:\n- Victory over obstacles through strategy; gains through service.\n- Careful management of property and health.\n\n*** Challenges:\n- Anxiety at home; health or enemy-related stress (Shakata Yoga).\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra; maintain health and avoid property disputes.",
    "7": "### Lord of 4th House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Harmonious home and balanced relationship with mother; partnership may affect property.\n\n*** Opportunities:\n- Wealth and harmony through partnership (Veenna Yoga).\n- Balanced approach to property and mother.\n\n*** Challenges:\n- Relationship instability affecting home (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra for partnership and Gayatri Mantra for clarity.",
    "8": "### Lord of 4th House (Scorpio) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Deep or transformative home life; property may involve inheritance or hidden matters.\n\n*** Opportunities:\n- Inheritance or gains through transformation.\n- Ability to handle domestic crisis and change.\n\n*** Challenges:\n- Financial or domestic instability; mother or property issues (Shakata Yoga).\n\n*** Recommendations:\n- Wear Red Coral; recite Maha Mrityunjaya Mantra; ensure legal clarity in property.",
    "9": "### Lord of 4th House (Sagittarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Philosophical or spacious home; mother or property linked to higher learning.\n\n*** Opportunities:\n- Fortune and property through education (Guru blessings).\n- Respectable position through perseverance.\n\n*** Challenges:\n- Delays in property or career if Jupiter retrograde; over-optimism.\n\n*** Recommendations:\n- Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 4th House (Capricorn) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Disciplined approach to home and property; mother may be serious or hardworking.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady property and career with patience.\n\n*** Challenges:\n- Delays or challenges in property and career (Saturn retrograde, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience and stability.",
    "11": "### Lord of 4th House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Unconventional home or friends at home; property through innovation or gains.\n\n*** Opportunities:\n- Gains through friends and innovation.\n- Unconventional but successful property matters.\n\n*** Challenges:\n- Communication and relationship instability; financial delays.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; choose partners wisely.",
    "12": "### Lord of 4th House (Pisces) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Spiritual or secluded home; mother may be compassionate; property for peace.\n\n*** Opportunities:\n- Gains through spirituality and compassion.\n- Peaceful home with spiritual or artistic touch.\n\n*** Challenges:\n- Expenses or confusion in property; need for practical planning.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity."
  },
  "5": {
    "1": "### Lord of 5th House (Aries) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Bold intelligence and active children; speculation with courage and creative initiative.\n\n*** Opportunities:\n- Victory in speculation and creative fields (Mangal in 5th).\n- Strong children and gains through courage.\n\n*** Challenges:\n- Impulsiveness in speculation; possible delays in progeny.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra; avoid reckless speculation. Chant Gayatri Mantra for intellect.",
    "2": "### Lord of 5th House (Taurus) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Steady gains from children and speculation; creativity with material comfort.\n\n*** Opportunities:\n- Wealth and financial stability through creativity (Dhana Yoga).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Stubbornness in speculation; delays if Venus afflicted.\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for overall well-being and clarity.",
    "3": "### Lord of 5th House (Gemini) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Quick intelligence and communicative children; speculation through trade or writing.\n\n*** Opportunities:\n- Success in education and speculation (Budh in 5th).\n- Intelligent children and multiple creative gains.\n\n*** Challenges:\n- Restlessness in speculation; need for focus.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra for clarity and focus.",
    "4": "### Lord of 5th House (Cancer) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Emotional bond with children; creativity linked to home or mother.\n\n*** Opportunities:\n- Gains through mother, property, or emotional intelligence.\n- Comfort from children and creative pursuits.\n\n*** Challenges:\n- Mood affecting speculation or children; over-sensitivity.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional stability.",
    "5": "### Lord of 5th House (Leo) ###\n*** Ranking: 9/10\n\n*** Prediction:\n- Strong creativity, proud children, and speculative gains; intelligence and progeny favored.\n\n*** Opportunities:\n- Raja Yoga, Maha Yoga; lucrative position and fame.\n- Leadership in creative and speculative fields.\n\n*** Challenges:\n- Ego in creativity or with children; over-speculation if Sun afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility and clarity.",
    "6": "### Lord of 5th House (Virgo) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Analytical intelligence; children or speculation may face health or service challenges.\n\n*** Opportunities:\n- Victory over enemies through strategy; gains through service.\n- Careful approach can reduce speculation losses.\n\n*** Challenges:\n- Financial instability due to health or enemies (Shakata Yoga).\n- Delays in children or speculation (Jupiter retrograde).\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra; avoid speculation. Chant Gayatri Mantra for overall well-being.",
    "7": "### Lord of 5th House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Balanced creativity and partnership in matters of children; speculation with diplomacy.\n\n*** Opportunities:\n- Wealth through partnership (Veenna Yoga).\n- Gains through balanced approach to children and speculation.\n\n*** Challenges:\n- Relationship instability affecting children (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for clarity and harmony.",
    "8": "### Lord of 5th House (Scorpio) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Deep or transformative interest in children and speculation; research or occult learning.\n\n*** Opportunities:\n- Gains through research or transformation.\n- Inheritance or sudden gains possible.\n\n*** Challenges:\n- Financial instability; delays in children (Shakata Yoga).\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Red Coral; recite Maha Mrityunjaya Mantra; avoid risky speculation.",
    "9": "### Lord of 5th House (Sagittarius) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Philosophical intelligence and lucky speculation; children may support higher learning.\n\n*** Opportunities:\n- Potential for wealth and respect (Dhana Yoga, Guru in 5th).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Delays if Jupiter retrograde; over-optimism in speculation.\n\n*** Recommendations:\n- Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 5th House (Capricorn) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Disciplined approach to children and speculation; gains through patience.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady gains with discipline.\n\n*** Challenges:\n- Financial instability; delays in career and children (Saturn retrograde, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience.",
    "11": "### Lord of 5th House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Innovative creativity and gains through children or friends; unconventional speculation.\n\n*** Opportunities:\n- Gains through friends and innovation.\n- Unconventional success in creativity.\n\n*** Challenges:\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; avoid reckless speculation.",
    "12": "### Lord of 5th House (Pisces) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Spiritual or compassionate connection with children; creativity for inner peace.\n\n*** Opportunities:\n- Gains through spirituality and compassion.\n- Intuitive creativity and spiritual children.\n\n*** Challenges:\n- Financial instability due to confusion or expenses (Shakata Yoga).\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity."
  },
  "6": {
    "1": "### Lord of 6th House (Aries) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Victory over enemies through courage; health may need active management.\n\n*** Opportunities:\n- Potential for victory and health (Mangal in 6th).\n- Success through courage and service.\n\n*** Challenges:\n- Anger or injury affecting health; need for discipline.\n\n*** Recommendations:\n- Wear Red Coral; recite Hanuman Chalisa or Mangal Mantra for health and discipline.",
    "2": "### Lord of 6th House (Taurus) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Steady victory over enemies; health and service with persistence.\n\n*** Opportunities:\n- Wealth and stability through service (Dhana Yoga).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Financial instability due to health (Shakata Yoga).\n- Delays or challenges in career (Jupiter retrograde).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra. Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being.",
    "3": "### Lord of 6th House (Gemini) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Overcoming enemies through communication; health linked to nervous system or siblings.\n\n*** Opportunities:\n- Victory through strategy and communication (Budh in 6th).\n- Gains through service or writing.\n\n*** Challenges:\n- Nervous or digestive issues; communication stress.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra for calm and clarity.",
    "4": "### Lord of 6th House (Cancer) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Emotional aspect to health and service; enemies overcome with patience.\n\n*** Opportunities:\n- Gains through mother or emotional intelligence in service.\n- Recovery with care and patience.\n\n*** Challenges:\n- Mood affecting health; anxiety or digestive issues.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional and physical well-being.",
    "5": "### Lord of 6th House (Leo) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Pride in service and victory; health may be generally good with care.\n\n*** Opportunities:\n- Success in service and victory over enemies (Sun in 6th).\n- Respect through discipline and authority in service.\n\n*** Challenges:\n- Ego in service; heart or digestive issues if Sun afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility.",
    "6": "### Lord of 6th House (Virgo) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Strong focus on health and service; analytical approach to enemies and routine.\n\n*** Opportunities:\n- Victory over enemies and good health (Budh in own 6th).\n- Success in service, health sector, and litigation.\n\n*** Challenges:\n- Over-anxiety or digestive issues; need for balance.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra for overall well-being and clarity.",
    "7": "### Lord of 6th House (Libra) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Balanced approach to health and partnerships; enemies overcome with diplomacy.\n\n*** Opportunities:\n- Gains through partnership and balance (Veenna Yoga).\n- Success in diplomatic resolution of conflicts.\n\n*** Challenges:\n- Financial instability; communication issues and relationship instability (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for clarity and harmony.",
    "8": "### Lord of 6th House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Deep or transformative health matters; enemies may be secretive; research helps.\n\n*** Opportunities:\n- Victory through research and strategy.\n- Success in healing or occult-related service.\n\n*** Challenges:\n- Chronic or sudden health issues; inheritance or secrecy in conflicts.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Maha Mrityunjaya Mantra for health.",
    "9": "### Lord of 6th House (Sagittarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Philosophical approach to health; fortune in overcoming enemies.\n\n*** Opportunities:\n- Potential for wealth and victory (Guru in 6th).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Delays if Jupiter retrograde; over-optimism in health or litigation.\n\n*** Recommendations:\n- Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 6th House (Capricorn) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Disciplined service and health management; enemies overcome with patience.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady victory and health with discipline.\n\n*** Challenges:\n- Delays or communication issues (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience.",
    "11": "### Lord of 6th House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Innovative health solutions; gains through service; friends may help with enemies.\n\n*** Opportunities:\n- Gains through friends and unconventional approach.\n- Success in technology or innovation in health.\n\n*** Challenges:\n- Relationship instability; financial or health delays.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; maintain genuine friendships.",
    "12": "### Lord of 6th House (Pisces) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Compassionate service; health may involve spirituality or rest.\n\n*** Opportunities:\n- Gains through spirituality and healing.\n- Recovery through compassion and rest.\n\n*** Challenges:\n- Expenses or confusion in health; need for practical care.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity and recovery."
  },
  "7": {
    "1": "### Lord of 7th House (Aries) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Active or assertive spouse and partnerships; marriage may be dynamic or competitive.\n\n*** Opportunities:\n- Potential for success through courage in partnership (Mangal in 7th).\n- Gains through spouse or business with initiative.\n\n*** Challenges:\n- Financial instability due to disputes (Shakata Yoga).\n- Delays or challenges in marriage (Jupiter retrograde).\n- Communication issues and relationship instability (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra. Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being and clarity.",
    "2": "### Lord of 7th House (Taurus) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Stable marriage and steady partner; partnership brings material comfort.\n\n*** Opportunities:\n- Potential for wealth and financial stability (Dhana Yoga).\n- Respectable position in career through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Financial instability due to Shakata Yoga.\n- Delays or challenges in career advancements (Jupiter retrograde).\n- Communication issues and relationship instability (retrograde Saturn, Rahu, Ketu in 7th house).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra. Wear a Yellow Sapphire to enhance Jupiter's positive influence; recite the Gayatri Mantra for overall well-being and clarity.",
    "3": "### Lord of 7th House (Gemini) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Communicative spouse and many contacts in partnership; marriage with intellectual exchange.\n\n*** Opportunities:\n- Gains through communication and partnership (Budh in 7th).\n- Success in business partnership and diplomacy.\n\n*** Challenges:\n- Restlessness in partnership; communication stress.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra and Gayatri Mantra for clarity and harmony.",
    "4": "### Lord of 7th House (Cancer) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Emotional and caring spouse; partnership focused on home and family.\n\n*** Opportunities:\n- Gains through mother, property, or emotional bond with spouse.\n- Domestic harmony and supportive partner.\n\n*** Challenges:\n- Mood affecting partnership; over-sensitivity or dependency.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional stability.",
    "5": "### Lord of 7th House (Leo) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Proud spouse and creative partnership; marriage with dignity and warmth.\n\n*** Opportunities:\n- Raja Yoga potential; lucrative position and fame through partnership.\n- Respect and success in marriage.\n\n*** Challenges:\n- Ego clashes in partnership; delays if Sun afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility.",
    "6": "### Lord of 7th House (Virgo) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Service-oriented or health-conscious spouse; partnership with attention to detail.\n\n*** Opportunities:\n- Victory over obstacles through strategy; gains through service-oriented partnership.\n\n*** Challenges:\n- Financial instability (Shakata Yoga); health or enemy issues affecting marriage.\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being.",
    "7": "### Lord of 7th House (Libra) ###\n*** Ranking: 9/10\n\n*** Prediction:\n- Balanced and harmonious marriage; partnership is central to life.\n\n*** Opportunities:\n- Excellent marriage and partnership (Venus in own 7th).\n- Wealth and harmony (Veenna Yoga); gains through spouse.\n\n*** Challenges:\n- Over-indulgence or dependency; need for individual identity.\n\n*** Recommendations:\n- Wear Diamond to enhance Venus; recite Shukra Mantra and Gayatri Mantra for clarity and balance.",
    "8": "### Lord of 7th House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Intense or transformative marriage; spouse may have depth or occult interest.\n\n*** Opportunities:\n- Gains through spouse, inheritance, or transformation.\n- Deep bond and ability to handle crisis together.\n\n*** Challenges:\n- Financial instability; secrecy or trust issues (Shakata Yoga).\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra. Recite Gayatri Mantra for clarity; ensure trust in partnership.",
    "9": "### Lord of 7th House (Sagittarius) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Philosophical or lucky in marriage; spouse may support higher learning.\n\n*** Opportunities:\n- Potential for wealth and respect (Dhana Yoga, Guru in 7th).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Delays if Jupiter retrograde; over-optimism in partnership.\n\n*** Recommendations:\n- Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 7th House (Capricorn) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Serious and responsible spouse; partnership built on discipline.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady marriage and career with patience.\n\n*** Challenges:\n- Financial instability; delays or challenges (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience and stability.",
    "11": "### Lord of 7th House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Independent or unconventional spouse; marriage with friends and ideals.\n\n*** Opportunities:\n- Gains through friends and unconventional partnership.\n- Success with space and mutual ideals.\n\n*** Challenges:\n- Communication issues and relationship instability (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; maintain communication and trust.",
    "12": "### Lord of 7th House (Pisces) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Compassionate and spiritual spouse; partnership may involve sacrifice or solitude.\n\n*** Opportunities:\n- Gains through spirituality and compassionate partnership.\n- Deep emotional and spiritual bond.\n\n*** Challenges:\n- Financial instability or confusion; need for practical balance.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity and harmony."
  },
  "8": {
    "1": "### Lord of 8th House (Aries) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Active interest in occult and transformation; longevity and inheritance may be eventful.\n\n*** Opportunities:\n- Gains through research, occult, or courage in crisis.\n- Success in transformation and inheritance with effort.\n\n*** Challenges:\n- Financial instability; sudden events (Shakata Yoga).\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal and Maha Mrityunjaya Mantra. Recite Gayatri Mantra for clarity.",
    "2": "### Lord of 8th House (Taurus) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Steady inheritance and longevity; transformation with material stability.\n\n*** Opportunities:\n- Wealth and financial stability through inheritance (Dhana Yoga).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Financial instability due to Shakata Yoga.\n- Delays in career or inheritance (Jupiter retrograde).\n- Communication issues (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "3": "### Lord of 8th House (Gemini) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Research and communication in occult matters; inheritance through siblings or writing.\n\n*** Opportunities:\n- Gains through research, writing, or siblings in 8th house matters.\n- Success in occult or investigative work.\n\n*** Challenges:\n- Nervous stress or anxiety; inheritance delays.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra and Maha Mrityunjaya Mantra for health and clarity.",
    "4": "### Lord of 8th House (Cancer) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Emotional transformation and inheritance linked to mother or property.\n\n*** Opportunities:\n- Gains through mother, property, or emotional resilience.\n- Recovery and transformation with care.\n\n*** Challenges:\n- Financial instability; mood affecting longevity matters.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra and Maha Mrityunjaya Mantra.",
    "5": "### Lord of 8th House (Leo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Proud or creative approach to occult; longevity and inheritance with dignity.\n\n*** Opportunities:\n- Gains through authority or creative handling of 8th house matters.\n- Respect in research or transformation.\n\n*** Challenges:\n- Ego in occult or inheritance; delays if Sun afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Maha Mrityunjaya Mantra.",
    "6": "### Lord of 8th House (Virgo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Analytical approach to occult and health; service in research or healing.\n\n*** Opportunities:\n- Victory over health or inheritance obstacles through strategy.\n- Success in healing or research.\n\n*** Challenges:\n- Financial instability (Shakata Yoga); anxiety in 8th house matters.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra and Gayatri Mantra for calm and clarity.",
    "7": "### Lord of 8th House (Libra) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Partnership in transformation; inheritance or longevity through spouse.\n\n*** Opportunities:\n- Gains through spouse and balanced approach (Veenna Yoga).\n- Success in partnership during transformation.\n\n*** Challenges:\n- Relationship instability (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for partnership clarity.",
    "8": "### Lord of 8th House (Scorpio) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Deep and natural strength in 8th house matters; occult, longevity, and transformation.\n\n*** Opportunities:\n- Strong 8th house (Mars in own sign); success in research, occult, inheritance.\n- Ability to handle crisis and transformation.\n\n*** Challenges:\n- Over-intensity or obsession; need for balance.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Maha Mrityunjaya Mantra for health and balance.",
    "9": "### Lord of 8th House (Sagittarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Philosophical or lucky in occult and inheritance; transformation through wisdom.\n\n*** Opportunities:\n- Fortune in 8th house matters (Guru in 8th).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Delays if Jupiter retrograde; over-optimism in inheritance.\n\n*** Recommendations:\n- Wear Yellow Sapphire; recite Gayatri Mantra and Maha Mrityunjaya Mantra for overall well-being.",
    "10": "### Lord of 8th House (Capricorn) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Disciplined approach to longevity and transformation; career may involve research.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady handling of inheritance and transformation.\n\n*** Challenges:\n- Delays or communication issues (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra and Maha Mrityunjaya Mantra.",
    "11": "### Lord of 8th House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Unconventional interest in occult; gains through transformation or research.\n\n*** Opportunities:\n- Gains through friends and innovation in 8th house matters.\n- Success in research or technology in occult.\n\n*** Challenges:\n- Relationship instability; financial or inheritance delays.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; ensure legal clarity in inheritance.",
    "12": "### Lord of 8th House (Pisces) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Spiritual transformation and compassion in 8th house matters; mystical interests.\n\n*** Opportunities:\n- Gains through spirituality and compassionate approach to transformation.\n- Success in healing or spiritual research.\n\n*** Challenges:\n- Confusion or expenses in 8th house matters; need for practical clarity.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra and Maha Mrityunjaya Mantra."
  },
  "9": {
    "1": "### Lord of 9th House (Aries) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Bold faith and active father; higher education and long travels with initiative.\n\n*** Opportunities:\n- Success through courage in dharma and travel (Mangal in 9th).\n- Gains through father and higher education.\n\n*** Challenges:\n- Ego in matters of faith; possible conflict with father.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra; honour father and guru. Chant Gayatri Mantra for clarity.",
    "2": "### Lord of 9th House (Taurus) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Steady fortune and stable relationship with father; dharma with material balance.\n\n*** Opportunities:\n- Potential for wealth and financial stability (Dhana Yoga).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Financial instability due to Shakata Yoga.\n- Delays or challenges (Jupiter retrograde).\n- Communication issues (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "3": "### Lord of 9th House (Gemini) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Intellectual faith and communicative father; higher learning through many sources.\n\n*** Opportunities:\n- Gains through education, writing, and father (Budh in 9th).\n- Success in higher learning and travel.\n\n*** Challenges:\n- Restlessness in belief or with father; need for focus.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra and Gayatri Mantra for clarity and faith.",
    "4": "### Lord of 9th House (Cancer) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Emotional faith and caring father; fortune linked to mother or home.\n\n*** Opportunities:\n- Fortune through mother and emotional intelligence (Chandra in 9th).\n- Strong father and guru support; domestic and spiritual harmony.\n\n*** Challenges:\n- Mood affecting faith or travel; over-sensitivity.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional and spiritual balance.",
    "5": "### Lord of 9th House (Leo) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Proud faith and dignified father; fortune through creativity and children.\n\n*** Opportunities:\n- Raja Yoga, Maha Yoga; lucrative position and fame through dharma.\n- Strong father and fortune (Sun in 9th).\n\n*** Challenges:\n- Ego in religion or with father; need for humility.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility and clarity.",
    "6": "### Lord of 9th House (Virgo) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Analytical approach to dharma and father; higher learning through service.\n\n*** Opportunities:\n- Victory over obstacles through strategy; gains through service and education.\n\n*** Challenges:\n- Financial instability (Shakata Yoga); anxiety in faith or with father.\n- Delays in career (Jupiter retrograde); communication issues.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being.",
    "7": "### Lord of 9th House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Balanced faith and partnership in matters of fortune; father may be diplomatic.\n\n*** Opportunities:\n- Wealth and harmony through partnership (Veenna Yoga).\n- Gains through spouse and balanced dharma.\n\n*** Challenges:\n- Relationship instability (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for clarity and harmony.",
    "8": "### Lord of 9th House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Deep or transformative faith; father or fortune through occult or research.\n\n*** Opportunities:\n- Gains through research, occult, or transformation in dharma.\n- Strong will in matters of faith.\n\n*** Challenges:\n- Financial instability; secrecy or trust issues with father.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Gayatri Mantra for clarity.",
    "9": "### Lord of 9th House (Sagittarius) ###\n*** Ranking: 9/10\n\n*** Prediction:\n- Strong and natural 9th house; fortune, father, and higher learning favored.\n\n*** Opportunities:\n- Excellent fortune and dharma (Guru in own 9th).\n- Raja Yoga potential; respect from father and guru.\n\n*** Challenges:\n- Over-optimism or over-religious zeal; need for practicality.\n\n*** Recommendations:\n- Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 9th House (Capricorn) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Disciplined faith and serious father; fortune through hard work.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady fortune and career with patience.\n\n*** Challenges:\n- Delays or challenges (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience and stability.",
    "11": "### Lord of 9th House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Unconventional faith and innovative father; fortune through friends and ideals.\n\n*** Opportunities:\n- Gains through friends and unconventional dharma.\n- Success in humanitarian or innovative higher learning.\n\n*** Challenges:\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; maintain balance between ideals and practice.",
    "12": "### Lord of 9th House (Pisces) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Spiritual faith and compassionate father; fortune through sacrifice or spirituality.\n\n*** Opportunities:\n- Gains through spirituality and compassion.\n- Strong intuition in dharma and father matters.\n\n*** Challenges:\n- Confusion or escapism in faith; need for practical dharma.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity and balance."
  },
  "10": {
    "1": "### Lord of 10th House (Aries) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Career with leadership and initiative; reputation through courage and action.\n\n*** Opportunities:\n- Potential for success and respect (Mangal in 10th).\n- Strong career in technical or leadership roles.\n\n*** Challenges:\n- Ego or conflict with mother; possible delays (Shakata Yoga).\n- Communication issues (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra. Recite Gayatri Mantra for overall well-being and clarity.",
    "2": "### Lord of 10th House (Taurus) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Steady career and reputation through persistence; authority with material success.\n\n*** Opportunities:\n- Wealth and financial stability (Dhana Yoga).\n- Respectable position in career through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Financial instability due to Shakata Yoga.\n- Delays or challenges in career (Jupiter retrograde).\n- Communication issues and relationship instability (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "3": "### Lord of 10th House (Gemini) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Career in communication, trade, or writing; reputation through intellect.\n\n*** Opportunities:\n- Success in business, media, or communication (Budh in 10th).\n- Gains through career and intellect.\n\n*** Challenges:\n- Restlessness or multiple career interests; need for focus.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra and Gayatri Mantra for clarity and focus.",
    "4": "### Lord of 10th House (Cancer) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Career linked to home, property, or emotions; reputation with care.\n\n*** Opportunities:\n- Gains through mother, property, or emotional intelligence in career.\n- Success in real estate or nurturing fields.\n\n*** Challenges:\n- Mood affecting career; possible conflict with mother.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional balance in career.",
    "5": "### Lord of 10th House (Leo) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Dignified career and proud reputation; authority through creativity and warmth.\n\n*** Opportunities:\n- Raja Yoga, Maha Yoga; lucrative position and fame.\n- Strong career and respect (Sun in 10th).\n\n*** Challenges:\n- Ego in career; tension with mother or authority.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility and clarity.",
    "6": "### Lord of 10th House (Virgo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Career in service, health, or detail-oriented work; reputation through discipline.\n\n*** Opportunities:\n- Victory over obstacles; success in service or health sector.\n\n*** Challenges:\n- Financial instability (Shakata Yoga); anxiety in career.\n- Delays (Jupiter retrograde); communication issues.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being.",
    "7": "### Lord of 10th House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Career through partnership or diplomacy; reputation for balance and harmony.\n\n*** Opportunities:\n- Wealth and success through partnership (Veenna Yoga).\n- Gains through spouse and diplomatic career.\n\n*** Challenges:\n- Relationship instability (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for clarity and harmony.",
    "8": "### Lord of 10th House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Career in research, occult, or transformation; reputation with depth.\n\n*** Opportunities:\n- Gains through research, occult, or transformation in career.\n- Success in crisis management or investigative work.\n\n*** Challenges:\n- Financial instability; sudden events (Shakata Yoga).\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Gayatri Mantra for clarity.",
    "9": "### Lord of 10th House (Sagittarius) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Career in teaching, law, or higher learning; reputation through wisdom.\n\n*** Opportunities:\n- Potential for wealth and respect (Dhana Yoga, Guru in 10th).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Delays if Jupiter retrograde; over-optimism in career.\n\n*** Recommendations:\n- Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 10th House (Capricorn) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Strong career and authority; reputation built through hard work and discipline.\n\n*** Opportunities:\n- Excellent career (Saturn in own 10th); Shasha Yoga.\n- Steady authority and respect through perseverance.\n\n*** Challenges:\n- Delays or communication issues (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience and stability.",
    "11": "### Lord of 10th House (Aquarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Career in innovation or humanitarian work; reputation through ideals and friends.\n\n*** Opportunities:\n- Gains through friends and innovation in career.\n- Success in technology or humanitarian fields.\n\n*** Challenges:\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; maintain ethics and communication.",
    "12": "### Lord of 10th House (Pisces) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Career may be behind the scenes or spiritual; reputation through compassion.\n\n*** Opportunities:\n- Gains through spirituality and compassionate work.\n- Success in healing, arts, or spiritual career.\n\n*** Challenges:\n- Expenses or confusion in career; need for practical focus.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity and balance."
  },
  "11": {
    "1": "### Lord of 11th House (Aries) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains through initiative and leadership; friends may be active or bold.\n\n*** Opportunities:\n- Potential for gains and success (Mangal in 11th).\n- Strong network and fulfillment of desires.\n\n*** Challenges:\n- Impulsiveness in gains; possible disputes with friends.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Gayatri Mantra for discipline and clarity.",
    "2": "### Lord of 11th House (Taurus) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Steady gains and stable friends; income with material growth.\n\n*** Opportunities:\n- Wealth and financial stability (Dhana Yoga).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Financial instability due to Shakata Yoga.\n- Delays (Jupiter retrograde); communication issues (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "3": "### Lord of 11th House (Gemini) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Gains through communication, siblings, or trade; many friends and contacts.\n\n*** Opportunities:\n- Success in gains and network (Budh in 11th).\n- Multiple sources of income and intellectual friends.\n\n*** Challenges:\n- Restlessness in gains; need for focus and consistency.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra and Gayatri Mantra for clarity.",
    "4": "### Lord of 11th House (Cancer) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains linked to home, mother, or emotions; friends provide emotional support.\n\n*** Opportunities:\n- Gains through mother, property, or emotional intelligence.\n- Comfortable network and emotional fulfillment of wishes.\n\n*** Challenges:\n- Mood affecting gains or friends; over-sensitivity.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional stability.",
    "5": "### Lord of 11th House (Leo) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains through creativity and proud friends; wishes fulfilled with dignity.\n\n*** Opportunities:\n- Raja Yoga potential; lucrative gains and fame.\n- Respect and success through network.\n\n*** Challenges:\n- Ego with friends; delays if Sun afflicted.\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility.",
    "6": "### Lord of 11th House (Virgo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Gains through service or health; friends may help in routine matters.\n\n*** Opportunities:\n- Victory over obstacles; gains through service and strategy.\n\n*** Challenges:\n- Financial instability (Shakata Yoga); health or enemy issues affecting gains.\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being.",
    "7": "### Lord of 11th House (Libra) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Gains through partnership; friends and income with balance.\n\n*** Opportunities:\n- Wealth and harmony through partnership (Veenna Yoga).\n- Gains through spouse and balanced network.\n\n*** Challenges:\n- Relationship instability (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for clarity and harmony.",
    "8": "### Lord of 11th House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Gains through inheritance, research, or transformation; deep or secretive friends.\n\n*** Opportunities:\n- Gains through transformation, research, or spouse.\n- Strong recovery and fulfillment of desires with effort.\n\n*** Challenges:\n- Financial instability; secrecy or sudden gains and losses.\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Gayatri Mantra for clarity.",
    "9": "### Lord of 11th House (Sagittarius) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Gains through fortune, father, or higher learning; lucky in friends and wishes.\n\n*** Opportunities:\n- Potential for wealth and respect (Dhana Yoga, Guru in 11th).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Delays if Jupiter retrograde; over-optimism in gains.\n\n*** Recommendations:\n- Wear Yellow Sapphire to enhance Jupiter; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 11th House (Capricorn) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Gains through career and reputation; friends may be serious or senior.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady gains and network with patience.\n\n*** Challenges:\n- Delays or communication issues (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience and stability.",
    "11": "### Lord of 11th House (Aquarius) ###\n*** Ranking: 7/10\n\n*** Prediction:\n- Strong gains and innovative friends; wishes through ideals and network.\n\n*** Opportunities:\n- Gains through friends and unconventional approach.\n- Success in groups and innovation (Rahu in 11th).\n\n*** Challenges:\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; choose friends wisely.",
    "12": "### Lord of 11th House (Pisces) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Gains may flow to spirituality or expenses; compassionate friends.\n\n*** Opportunities:\n- Gains through spirituality and compassion.\n- Fulfillment of wishes with spiritual or artistic touch.\n\n*** Challenges:\n- Financial instability due to expenses or confusion (Shakata Yoga).\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra for clarity and prudent spending."
  },
  "12": {
    "1": "### Lord of 12th House (Aries) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses or solitude with active or restless element; foreign lands with initiative.\n\n*** Opportunities:\n- Success in foreign lands or through courage in solitude.\n- Gains through research or transformation.\n\n*** Challenges:\n- Financial instability (Shakata Yoga); expenses and restlessness.\n- Communication issues (retrograde Saturn, Rahu, Ketu).\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Gayatri Mantra for discipline and clarity.",
    "2": "### Lord of 12th House (Taurus) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Steady expenses and comfort in solitude; foreign lands with material comfort.\n\n*** Opportunities:\n- Wealth and stability through careful management (Dhana Yoga).\n- Respectable position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Financial instability due to Shakata Yoga.\n- Delays (Jupiter retrograde); communication issues (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "3": "### Lord of 12th House (Gemini) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses on communication or short travels; solitude with mental activity.\n\n*** Opportunities:\n- Gains through writing, research, or spiritual communication.\n- Success in foreign or behind-the-scenes work.\n\n*** Challenges:\n- Financial instability; nervous stress or expenses.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra and Gayatri Mantra for calm and clarity.",
    "4": "### Lord of 12th House (Cancer) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Emotional expenses and attachment in solitude; foreign lands or property abroad.\n\n*** Opportunities:\n- Gains through mother, property abroad, or emotional resilience.\n- Spiritual or emotional comfort in solitude.\n\n*** Challenges:\n- Expenses or mood affecting 12th house matters.\n\n*** Recommendations:\n- Wear Pearl or Moonstone; recite Chandra Mantra for emotional and financial balance.",
    "5": "### Lord of 12th House (Leo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Expenses on creativity or children; solitude with dignity; spiritual creativity.\n\n*** Opportunities:\n- Gains through spiritual creativity or behind-the-scenes authority.\n- Respect in charitable or spiritual work.\n\n*** Challenges:\n- Financial instability; ego or delays (Sun afflicted).\n\n*** Recommendations:\n- Wear Ruby or Red Coral; recite Surya Mantra and Gayatri Mantra for humility and clarity.",
    "6": "### Lord of 12th House (Virgo) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Expenses on health or service; solitude with routine or healing.\n\n*** Opportunities:\n- Victory over health or enemy obstacles; gains through service abroad.\n- Success in healing or spiritual service.\n\n*** Challenges:\n- Financial instability (Shakata Yoga); anxiety in 12th house matters.\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Emerald; recite Budh Mantra. Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being.",
    "7": "### Lord of 12th House (Libra) ###\n*** Ranking: 5/10\n\n*** Prediction:\n- Expenses or solitude linked to partnership; foreign lands with spouse possible.\n\n*** Opportunities:\n- Gains through spouse or balanced approach in 12th house (Veenna Yoga).\n- Success in foreign partnership or diplomacy.\n\n*** Challenges:\n- Relationship instability (retrograde Saturn, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Diamond; recite Shukra Mantra and Gayatri Mantra for clarity and harmony.",
    "8": "### Lord of 12th House (Scorpio) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Deep expenses and transformative solitude; occult or research in isolation.\n\n*** Opportunities:\n- Gains through research, occult, or transformation in 12th house.\n- Success in spiritual or investigative solitude.\n\n*** Challenges:\n- Financial instability; secrecy or sudden events.\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Red Coral; recite Mangal Mantra and Maha Mrityunjaya Mantra. Recite Gayatri Mantra for clarity.",
    "9": "### Lord of 12th House (Sagittarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Expenses on faith or long travels; spiritual solitude and higher learning.\n\n*** Opportunities:\n- Fortune in 12th house matters (Guru in 12th).\n- Respectable spiritual position through perseverance (Shasha Yoga).\n\n*** Challenges:\n- Delays if Jupiter retrograde; expenses or confusion in spirituality.\n\n*** Recommendations:\n- Wear Yellow Sapphire; recite Gayatri Mantra for overall well-being and clarity.",
    "10": "### Lord of 12th House (Capricorn) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Expenses on career or reputation; solitude with discipline; work behind the scenes.\n\n*** Opportunities:\n- Success through perseverance (Shasha Yoga).\n- Steady gains in 12th house with patience.\n\n*** Challenges:\n- Delays or communication issues (Saturn retrograde, Rahu, Ketu in 7th).\n\n*** Recommendations:\n- Wear Blue Sapphire (after consultation); recite Shani Mantra for patience and stability.",
    "11": "### Lord of 12th House (Aquarius) ###\n*** Ranking: 6/10\n\n*** Prediction:\n- Expenses on friends or ideals; solitude with innovation or humanitarian work.\n\n*** Opportunities:\n- Gains through friends and unconventional 12th house work.\n- Success in humanitarian or spiritual innovation.\n\n*** Challenges:\n- Communication issues and relationship instability.\n\n*** Recommendations:\n- Wear Hessonite (with guidance); recite Rahu Mantra; balance ideals with practical spending.",
    "12": "### Lord of 12th House (Pisces) ###\n*** Ranking: 8/10\n\n*** Prediction:\n- Strong 12th house; spirituality, compassion, and liberation. Natural fit for solitude and expenses.\n\n*** Opportunities:\n- Excellent 12th house (Jupiter in own 12th); spiritual liberation.\n- Success in spirituality, charity, and foreign lands.\n\n*** Challenges:\n- Over-optimism in expenses or spirituality; need for practical balance.\n\n*** Recommendations:\n- Wear Yellow Sapphire or Pearl; recite Guru or Chandra Mantra and Gayatri Mantra for overall well-being and clarity."
  }
}
